In [1]:
import pymongo
import pandas as pd
import pickle
import datetime
import time
import gzip
import lzma
import pytz

class DB(object):
    def __init__(self, uri, symbol_column='skey'):
        self.db_name = 'white_db'
        user, passwd, host = self.parse_uri(uri)
        auth_db = 'admin' if user in ('admin', 'root') else self.db_name
        self.uri = 'mongodb://%s:%s@%s/?authSource=%s' % (user, passwd, host, auth_db)

        self.client = pymongo.MongoClient(self.uri)
        self.db = self.client[self.db_name]
        self.chunk_size = 20000
        self.symbol_column = symbol_column
        self.date_column = 'date'

    def parse_uri(self, uri):
        # mongodb://user:password@example.com
        return uri.strip().replace('mongodb://', '').strip('/').replace(':', ' ').replace('@', ' ').split(' ')

    def drop_table(self, table_name):
        self.db.drop_collection(table_name)

    def rename_table(self, old_table, new_table):
        self.db[old_table].rename(new_table)

    def write(self, table_name, df):
        if len(df) == 0: return

        multi_date = False

        if self.date_column in df.columns:
            date = str(df.head(1)[self.date_column].iloc[0])
            multi_date = len(df[self.date_column].unique()) > 1
        else:
            raise Exception('DataFrame should contain date column')

        collection = self.db[table_name]
        collection.create_index([('date', pymongo.ASCENDING), ('symbol', pymongo.ASCENDING)], background=True)
        collection.create_index([('symbol', pymongo.ASCENDING), ('date', pymongo.ASCENDING)], background=True)

        if multi_date:
            for (date, symbol), sub_df in df.groupby([self.date_column, self.symbol_column]):
                date = str(date)
                symbol = int(symbol)
                collection.delete_many({'date': date, 'symbol': symbol})
                self.write_single(collection, date, symbol, sub_df)
        else:
            for symbol, sub_df in df.groupby([self.symbol_column]):
                collection.delete_many({'date': date, 'symbol': symbol})
                self.write_single(collection, date, symbol, sub_df)

    def write_single(self, collection, date, symbol, df):
        for start in range(0, len(df), self.chunk_size):
            end = min(start + self.chunk_size, len(df))
            df_seg = df[start:end]
            version = 1
            seg = {'ver': version, 'data': self.ser(df_seg, version), 'date': date, 'symbol': symbol, 'start': start}
            collection.insert_one(seg)

    def build_query(self, start_date=None, end_date=None, symbol=None):
        query = {}

        def parse_date(x):
            if type(x) == str:
                if len(x) != 8:
                    raise Exception("`date` must be YYYYMMDD format")
                return x
            elif type(x) == datetime.datetime or type(x) == datetime.date:
                return x.strftime("%Y%m%d")
            elif type(x) == int:
                return parse_date(str(x))
            else:
                raise Exception("invalid `date` type: " + str(type(x)))

        if start_date is not None or end_date is not None:
            query['date'] = {}
            if start_date is not None:
                query['date']['$gte'] = parse_date(start_date)
            if end_date is not None:
                query['date']['$lte'] = parse_date(end_date)

        def parse_symbol(x):
            if type(x) == int:
                return x
            else:
                return int(x)

        if symbol:
            if type(symbol) == list or type(symbol) == tuple:
                query['symbol'] = {'$in': [parse_symbol(x) for x in symbol]}
            else:
                query['symbol'] = parse_symbol(symbol)

        return query

    def delete(self, table_name, start_date=None, end_date=None, symbol=None):
        collection = self.db[table_name]

        query = self.build_query(start_date, end_date, symbol)
        if not query:
            print('cannot delete the whole table')
            return None

        collection.delete_many(query)

    def read(self, table_name, start_date=None, end_date=None, symbol=None):
        collection = self.db[table_name]

        query = self.build_query(start_date, end_date, symbol)
        if not query:
            print('cannot read the whole table')
            return None

        segs = []
        for x in collection.find(query):
            x['data'] = self.deser(x['data'], x['ver'])
            segs.append(x)
        segs.sort(key=lambda x: (x['symbol'], x['date'], x['start']))
        return pd.concat([x['data'] for x in segs], ignore_index=True) if segs else None

    def list_tables(self):
        return self.db.collection_names()

    def list_dates(self, table_name, start_date=None, end_date=None, symbol=None):
        collection = self.db[table_name]
        dates = set()
        if start_date is None:
            start_date = '00000000'
        if end_date is None:
            end_date = '99999999'
        for x in collection.find(self.build_query(start_date, end_date, symbol), {"date": 1, '_id': 0}):
            dates.add(x['date'])
        return sorted(list(dates))

    def ser(self, s, version):
        if version == 1:
            return gzip.compress(pickle.dumps(s), compresslevel=2)
        elif version == 2:
            return lzma.compress(pickle.dumps(s), preset=1)
        else:
            raise Exception('unknown version')

    def deser(self, s, version):
        def unpickle(s):
            return pickle.loads(s)

        if version == 1:
            return unpickle(gzip.decompress(s))
        elif version == 2:
            return unpickle(lzma.decompress(s))
        else:
            raise Exception('unknown version')

In [2]:
import pandas as pd
import random
import numpy as np
import glob
import os
from unrar import rarfile
import py7zr
import pickle
import datetime
import time
pd.set_option("max_columns", 200)

startTm = datetime.datetime.now()
readPath = r'\\192.168.10.30\Kevin_zhenyu\day_stock_20200424\***'
dataPathLs = np.array(glob.glob(readPath))
dataPathLs = dataPathLs[[np.array([os.path.basename(i).split('.')[0][:2] == 'SZ' for i in dataPathLs])]]
db = pd.DataFrame()
for p in dataPathLs:
    dayData = pd.read_csv(p, compression='gzip')
    db = pd.concat([db, dayData])
print(datetime.datetime.now() - startTm)

year = "2019"
startDate = '20190102'
endDate = '20190930'
readPath = 'G:\\KR\\' + year + '\\SZ\\***'
dataPathLs = np.array(glob.glob(readPath))
dateLs = np.array([os.path.basename(i) for i in dataPathLs])
dataPathLs = dataPathLs[(dateLs >= startDate) & (dateLs <= endDate)]

for data in dataPathLs:
    
    startTm = datetime.datetime.now()
    
    readPath = data + '\\tick\\***'
    dataPathLs = np.array(glob.glob(readPath))
    dateLs = np.array([int(os.path.basename(i).split('.')[0]) for i in dataPathLs])
    dataPathLs = dataPathLs[(dateLs < 4000) | ((dateLs > 300000) & (dateLs < 310000))]
    TradeLog = []
    ll = []
    
    for i in dataPathLs:
        try:
            df = pd.read_csv(i)
        except:
            print("empty data")
            print(i)
            ll.append(int(os.path.basename(i).split('.')[0]))
            continue
        df["SecurityID"] = int(os.path.basename(i).split('.')[0])
        TradeLog += [df]
    TradeLog = pd.concat(TradeLog).reset_index(drop=True)
    TradeLog = TradeLog[TradeLog["ChannelNo"] != 4001]
    
    TradeLog["date"] = TradeLog["TransactTime"].iloc[0]//1000000000
    TradeLog = TradeLog.rename(columns={"Qty":"trade_qty", "Price":"trade_price", "ExecType":"trade_type"})
    TradeLog["trade_money"] = TradeLog["trade_price"] * TradeLog["trade_qty"]
    TradeLog["trade_flag"] = 0
    TradeLog["skey"] = TradeLog["SecurityID"] + 2000000
    TradeLog["clockAtArrival"] = TradeLog["TransactTime"].astype(str).apply(lambda x: np.int64(datetime.datetime.strptime(x, '%Y%m%d%H%M%S%f').timestamp()*1e6))
    TradeLog['datetime'] = TradeLog["clockAtArrival"].apply(lambda x: datetime.datetime.fromtimestamp(x/1e6))
    TradeLog["time"] = (TradeLog['TransactTime'] - int(TradeLog['TransactTime'].iloc[0]//1000000000*1000000000)).astype(np.int64)*1000
    TradeLog["trade_type"] = np.where(TradeLog["trade_type"] == 'F', 1, TradeLog["trade_type"])
    for col in ["skey", "date", "ApplSeqNum", "BidApplSeqNum", "OfferApplSeqNum", "trade_qty", "trade_type", "trade_flag"]:
        TradeLog[col] = TradeLog[col].astype('int32')
#     for cols in ["trade_money", "trade_price"]:
#         display(cols)
#         display(TradeLog[cols].astype(str).apply(lambda x: len(str(x.split('.')[1]))).unique())
#         TradeLog[cols] = TradeLog[cols].round(2)
#         display(TradeLog[cols].astype(str).apply(lambda x: len(str(x.split('.')[1]))).unique())
    for cols in ["trade_money"]:
        TradeLog[cols] = TradeLog[cols].round(2)
    
    da_te = str(TradeLog["date"].iloc[0]) 
    da_te = da_te[:4] + '-' + da_te[4:6] + '-' + da_te[6:8]
    db1 = db[db["date"] == da_te]
    sl = (db1["ID"].str[2:].astype(int) + 2000000).unique()
    db1["max_volume"] = db1.groupby("ID")["d_volume"].transform("max")
    db1["max_amount"] = db1.groupby("ID")["d_amount"].transform("max")
    t1 = db1.groupby("ID")["max_volume", "max_amount"].first().reset_index()
    del db1
    t1["skey"] = t1["ID"].str[2:].astype(int) + 2000000
    trade1 = TradeLog[TradeLog["trade_type"] == 1].groupby("skey")["trade_qty"].sum().reset_index()
    trade1.columns=["skey", "cum_volume"]
    trade2 = TradeLog[TradeLog["trade_type"] == 1].groupby("skey")["trade_money"].sum().reset_index()
    trade2.columns=["skey", "cum_amount"]
    t2 = pd.merge(trade1, trade2, on="skey")
    re = pd.merge(t1, t2, on="skey", how="outer")
    try:
        assert(t1.shape[0] == t2.shape[0])
        assert(re[re["cum_volume"] != re["max_volume"]].shape[0] == 0)
        assert(re[re["cum_amount"].round(2) != re["max_amount"]].shape[0] == 0)
    except:
        display(set(t1["skey"]) - set(t2["skey"]))
        display(re[re["cum_volume"] != re["max_volume"]])
        display(re[re["cum_amount"].round(2) != re["max_amount"]])
    del t1
    del t2
    del re
 
    TradeLog = TradeLog[["skey", "date", "time", "clockAtArrival", "datetime", "ApplSeqNum", "trade_type", "trade_flag",
                                                 "trade_price", "trade_qty", "BidApplSeqNum", "OfferApplSeqNum"]]
    print(da_te)
    print("trade finished")

    
    startDate = str(TradeLog["date"].iloc[0])
    endDate = str(TradeLog["date"].iloc[0])
    db1 = DB("mongodb://user_rw:faa96dfc@192.168.10.223")
    # delete all stocks from certain period
    db1.delete('trade', start_date=startDate, end_date=endDate)
    
    db1 = DB("mongodb://user_rw:faa96dfc@192.168.10.223")
    db1.write('trade', TradeLog)
    
    del TradeLog
    print(datetime.datetime.now() - startTm)
    
    
    
    
    
    
    
    
    
    
    
    startTm = datetime.datetime.now()
    
    readPath = data + '\\order\\***'
    dataPathLs = np.array(glob.glob(readPath))
    dateLs = np.array([int(os.path.basename(i).split('.')[0]) for i in dataPathLs])
    dataPathLs = dataPathLs[(dateLs < 4000) | ((dateLs > 300000) & (dateLs < 310000))]
    OrderLog = []
    ll = []
    
    for i in dataPathLs:
        try:
            df = pd.read_csv(i, encoding='GBK')
        except:
            print("empty data")
            print(i)
            ll.append(int(os.path.basename(i).split('.')[0]))
            continue
        df["SecurityID"] = int(os.path.basename(i).split('.')[0])
        OrderLog += [df]
    OrderLog = pd.concat(OrderLog).reset_index(drop=True)
    OrderLog = OrderLog[OrderLog["ChannelNo"] != 4001]
    
    OrderLog = OrderLog.rename(columns={"OrdType": "OrderType"})
    OrderLog["date"] = OrderLog["TransactTime"].iloc[0]//1000000000
    OrderLog["OrderType"] = np.where(OrderLog["OrderType"] == 'U', 3, OrderLog["OrderType"])
    OrderLog["skey"] = OrderLog["SecurityID"] + 2000000
    OrderLog["clockAtArrival"] = OrderLog["TransactTime"].astype(str).apply(lambda x: np.int64(datetime.datetime.strptime(x, '%Y%m%d%H%M%S%f').timestamp()*1e6))
    OrderLog['datetime'] = OrderLog["clockAtArrival"].apply(lambda x: datetime.datetime.fromtimestamp(x/1e6))
    OrderLog["time"] = (OrderLog['TransactTime'] - int(OrderLog['TransactTime'].iloc[0]//1000000000*1000000000)).astype(np.int64)*1000
    
    for col in ["skey", "date", "ApplSeqNum", "OrderQty", "Side", "OrderType"]:
        OrderLog[col] = OrderLog[col].astype('int32')
#     for cols in ["Price"]:
#         print(cols)
#         print(OrderLog[cols].astype(str).apply(lambda x: len(str(x.split('.')[1]))).unique())
    
    assert(OrderLog[((OrderLog["Side"] != 1) & (OrderLog["Side"] != 2)) | (OrderLog["OrderType"].isnull())].shape[0] == 0)
    da_te = str(OrderLog["date"].iloc[0]) 
    da_te = da_te[:4] + '-' + da_te[4:6] + '-' + da_te[6:8]
    try:
        assert(len(set(sl) - set(OrderLog["skey"].unique())) == 0)
    except:
        display(set(sl) - set(OrderLog["skey"].unique()))
    if len(set(OrderLog["skey"].unique()) - set(sl)) != 0:
        print(set(OrderLog["skey"].unique()) - set(sl))
    
    OrderLog = OrderLog.rename(columns={"Side":"order_side", "OrderType":"order_type", "Price":"order_price", "OrderQty":"order_qty"})
    OrderLog = OrderLog[["skey", "date", "time", "clockAtArrival", "datetime", "ApplSeqNum", "order_side", "order_type", "order_price",
                                                 "order_qty"]]
    
    print(OrderLog["date"].iloc[0])
    print("order finished")

    startDate = str(OrderLog["date"].iloc[0])
    endDate = str(OrderLog["date"].iloc[0])
    db1 = DB("mongodb://user_rw:faa96dfc@192.168.10.223")
    # delete all stocks from certain period
    db1.delete('order', start_date=startDate, end_date=endDate)
    
    db1 = DB("mongodb://user_rw:faa96dfc@192.168.10.223")
    db1.write('order', OrderLog)
    
    del OrderLog
    
    print(datetime.datetime.now() - startTm)

C:\Users\win\Anaconda3\lib\site-packages\ipykernel_launcher.py:16: FutureWarning: Using a non-tuple sequence for multidimensional indexing is deprecated; use `arr[tuple(seq)]` instead of `arr[seq]`. In the future this will be interpreted as an array index, `arr[np.array(seq)]`, which will result either in an error or a different result.
  app.launch_new_instance()

0:03:57.604823

C:\Users\win\Anaconda3\lib\site-packages\ipykernel_launcher.py:78: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
C:\Users\win\Anaconda3\lib\site-packages\ipykernel_launcher.py:79: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
457  SZ001914   1484088.0  11059300.11  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
457  SZ001914   1484088.0  11059300.11  2001914         NaN         NaN

2019-01-02
trade finished
0:03:27.585516

C:\Users\win\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3058: DtypeWarning: Columns (1) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

{2001914}

20190102
order finished
0:04:02.612966

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
458  SZ001914   3523797.0  26558986.95  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
458  SZ001914   3523797.0  26558986.95  2001914         NaN         NaN

2019-01-03
trade finished
0:04:10.711188

C:\Users\win\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3058: DtypeWarning: Columns (4) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

{2001914}

20190103
order finished
0:04:50.331278

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
458  SZ001914   3647801.0  27877048.68  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
458  SZ001914   3647801.0  27877048.68  2001914         NaN         NaN

2019-01-04
trade finished
0:04:46.931280

C:\Users\win\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3058: DtypeWarning: Columns (1,4) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

{2001914}

20190104
order finished
0:05:15.718257

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
458  SZ001914   3747879.0  29401749.87  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
458  SZ001914   3747879.0  29401749.87  2001914         NaN         NaN

2019-01-07
trade finished
0:04:54.791702

{2001914}

20190107
order finished
0:06:03.136519

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
458  SZ001914   2170084.0  17154895.17  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
458  SZ001914   2170084.0  17154895.17  2001914         NaN         NaN

2019-01-08
trade finished
0:04:51.441701

{2001914}

20190108
order finished
0:05:23.637613

{2000592,
 2000593,
 2000609,
 2000620,
 2000688,
 2000695,
 2000703,
 2000707,
 2000806,
 2000828,
 2000829,
 2000888,
 2000918,
 2000957,
 2000961,
 2001914,
 2002001,
 2002039,
 2002448,
 2002461,
 2002464,
 2002465,
 2002466,
 2002469,
 2002470,
 2002473,
 2002477,
 2002482,
 2002484,
 2002485,
 2002498,
 2002502,
 2002503,
 2002520,
 2002531,
 2002533,
 2002534,
 2002535,
 2002540,
 2002542,
 2002550,
 2002561,
 2002562,
 2002590,
 2002594,
 2002600,
 2002602,
 2300353,
 2300357,
 2300358,
 2300365,
 2300366,
 2300376,
 2300491,
 2300494,
 2300496,
 2300499,
 2300500,
 2300510,
 2300520,
 2300533,
 2300534,
 2300536,
 2300537}

            ID   max_volume    max_amount     skey  cum_volume  cum_amount
170   SZ000592  124922056.0  4.117239e+08  2000592         NaN         NaN
171   SZ000593   17493519.0  1.261594e+08  2000593         NaN         NaN
184   SZ000609   12584776.0  6.671267e+07  2000609         NaN         NaN
193   SZ000620    4815749.0  1.975067e+07  2000620         NaN         NaN
240   SZ000688     811091.0  9.264274e+06  2000688         NaN         NaN
...        ...          ...           ...      ...         ...         ...
1892  SZ300520    3030172.0  4.771402e+07  2300520         NaN         NaN
1904  SZ300533     727244.0  2.376956e+07  2300533         NaN         NaN
1905  SZ300534    3316700.0  1.996293e+07  2300534         NaN         NaN
1907  SZ300536    1914924.0  1.719964e+07  2300536         NaN         NaN
1908  SZ300537    2244440.0  2.076892e+07  2300537         NaN         NaN

[64 rows x 6 columns]

            ID   max_volume    max_amount     skey  cum_volume  cum_amount
170   SZ000592  124922056.0  4.117239e+08  2000592         NaN         NaN
171   SZ000593   17493519.0  1.261594e+08  2000593         NaN         NaN
184   SZ000609   12584776.0  6.671267e+07  2000609         NaN         NaN
193   SZ000620    4815749.0  1.975067e+07  2000620         NaN         NaN
240   SZ000688     811091.0  9.264274e+06  2000688         NaN         NaN
...        ...          ...           ...      ...         ...         ...
1892  SZ300520    3030172.0  4.771402e+07  2300520         NaN         NaN
1904  SZ300533     727244.0  2.376956e+07  2300533         NaN         NaN
1905  SZ300534    3316700.0  1.996293e+07  2300534         NaN         NaN
1907  SZ300536    1914924.0  1.719964e+07  2300536         NaN         NaN
1908  SZ300537    2244440.0  2.076892e+07  2300537         NaN         NaN

[64 rows x 6 columns]

2019-01-09
trade finished
0:05:39.098700

{2001914}

20190109
order finished
0:06:01.001096

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
458  SZ001914   1284462.0  10078827.78  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
458  SZ001914   1284462.0  10078827.78  2001914         NaN         NaN

2019-01-10
trade finished
0:04:58.770602

{2001914}

20190110
order finished
0:05:35.549197

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
458  SZ001914   1832879.0  14370527.04  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
458  SZ001914   1832879.0  14370527.04  2001914         NaN         NaN

2019-01-11
trade finished
0:05:09.962657

{2001914}

20190111
order finished
0:05:22.330565

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
457  SZ001914   1912636.0  14871870.42  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
457  SZ001914   1912636.0  14871870.42  2001914         NaN         NaN

2019-01-14
trade finished
0:04:37.932357

{2001914}

20190114
order finished
0:05:28.260938

{2001914}

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
457  SZ001914   1799500.0  13922067.0  2001914         NaN         NaN

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
457  SZ001914   1799500.0  13922067.0  2001914         NaN         NaN

2019-01-15
trade finished
0:04:52.113732

{2001914}

20190115
order finished
0:06:22.389602

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   2361718.0  18362042.54  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   2361718.0  18362042.54  2001914         NaN         NaN

2019-01-21
trade finished
0:05:10.518503

{2001914}

20190121
order finished
0:05:10.604937

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   2572745.0  19910513.08  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   2572745.0  19910513.08  2001914         NaN         NaN

2019-01-22
trade finished
0:04:23.137941

{2001914}

20190122
order finished
0:04:58.236033

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   1354203.0  10434827.97  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   1354203.0  10434827.97  2001914         NaN         NaN

2019-01-23
trade finished
0:04:05.643751

{2001914}

20190123
order finished
0:04:34.320022

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
457  SZ001914   2977257.0  23146333.97  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
457  SZ001914   2977257.0  23146333.97  2001914         NaN         NaN

2019-01-24
trade finished
0:04:36.200991

{2001914}

20190124
order finished
0:05:09.757206

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
458  SZ001914   2077062.0  16188605.92  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
458  SZ001914   2077062.0  16188605.92  2001914         NaN         NaN

2019-01-25
trade finished
0:04:34.941360

{2001914}

20190125
order finished
0:05:07.365605

{2001914}

            ID  max_volume   max_amount     skey  cum_volume   cum_amount
459   SZ001914   2499185.0  19423594.21  2001914         NaN          NaN
1323  SZ002881   2728220.0  49844602.36  2002881   2395120.0  24811607.56

            ID  max_volume   max_amount     skey  cum_volume   cum_amount
459   SZ001914   2499185.0  19423594.21  2001914         NaN          NaN
1323  SZ002881   2728220.0  49844602.36  2002881   2395120.0  24811607.56

2019-01-28
trade finished
0:04:31.569383

{2001914}

20190128
order finished
0:05:05.756909

{2001914}

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
459  SZ001914   2883388.0  21659758.7  2001914         NaN         NaN

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
459  SZ001914   2883388.0  21659758.7  2001914         NaN         NaN

2019-01-29
trade finished
0:04:35.420080

{2001914}

20190129
order finished
0:05:12.995541

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
459  SZ001914   2293462.0  17275411.79  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
459  SZ001914   2293462.0  17275411.79  2001914         NaN         NaN

2019-01-30
trade finished
0:04:13.422936

{2001914}

20190130
order finished
0:04:26.499946

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
459  SZ001914   2739777.0  20258619.37  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
459  SZ001914   2739777.0  20258619.37  2001914         NaN         NaN

2019-01-31
trade finished
0:04:23.248646

{2001914}

20190131
order finished
0:04:57.185842

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
459  SZ001914   1502778.0  11161549.58  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
459  SZ001914   1502778.0  11161549.58  2001914         NaN         NaN

2019-02-01
trade finished
0:04:04.950605

{2001914}

20190201
order finished
0:04:29.138885

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
459  SZ001914   2928462.0  22143814.94  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
459  SZ001914   2928462.0  22143814.94  2001914         NaN         NaN

2019-02-11
trade finished
0:04:23.179830

{2001914}

20190211
order finished
0:05:23.751762

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
459  SZ001914   2464338.0  18967629.76  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
459  SZ001914   2464338.0  18967629.76  2001914         NaN         NaN

2019-02-12
trade finished
0:04:55.813515

{2001914}

20190212
order finished
0:05:33.681194

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
459  SZ001914   3594728.0  28082831.32  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
459  SZ001914   3594728.0  28082831.32  2001914         NaN         NaN

2019-02-13
trade finished
0:05:40.285524

{2001914}

20190213
order finished
0:06:18.608985

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
459  SZ001914   2421625.0  19009695.35  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
459  SZ001914   2421625.0  19009695.35  2001914         NaN         NaN

2019-02-14
trade finished
0:05:33.304203

{2001914}

20190214
order finished
0:07:03.640498

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
459  SZ001914   2565181.0  20152770.82  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
459  SZ001914   2565181.0  20152770.82  2001914         NaN         NaN

2019-02-15
trade finished
0:05:32.647959

{2000725, 2001914}

20190215
order finished
0:06:04.564563

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
458  SZ001914   4633172.0  36730828.99  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
458  SZ001914   4633172.0  36730828.99  2001914         NaN         NaN

2019-02-18
trade finished
0:06:24.724621

{2001914}

20190218
order finished
0:07:09.601548

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
458  SZ001914   4655502.0  36901598.59  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
458  SZ001914   4655502.0  36901598.59  2001914         NaN         NaN

2019-02-19
trade finished
0:08:06.063477

{2001914}

20190219
order finished
0:07:59.727430

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   3267831.0  25667336.93  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   3267831.0  25667336.93  2001914         NaN         NaN

2019-02-20
trade finished
0:07:05.979240

{2001914}

20190220
order finished
0:07:06.096925

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
459  SZ001914   3857454.0  30462105.59  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
459  SZ001914   3857454.0  30462105.59  2001914         NaN         NaN

2019-02-21
trade finished
0:07:23.978082

{2001914}

20190221
order finished
0:08:13.883553

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
459  SZ001914   3666450.0  28742624.12  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
459  SZ001914   3666450.0  28742624.12  2001914         NaN         NaN

2019-02-22
trade finished
0:07:03.452002

{2001914}

20190222
order finished
0:07:50.178979

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
457  SZ001914   9854330.0  80103423.95  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
457  SZ001914   9854330.0  80103423.95  2001914         NaN         NaN

2019-02-25
trade finished
0:09:32.652796

C:\Users\win\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3058: DtypeWarning: Columns (6) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

{2000901, 2001914}

20190225
order finished
0:10:22.533335

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
457  SZ001914   9275906.0  76575647.57  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
457  SZ001914   9275906.0  76575647.57  2001914         NaN         NaN

2019-02-26
trade finished
0:11:29.561992

{2001914}

20190226
order finished
0:11:25.162762

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
457  SZ001914   9424092.0  78393415.96  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
457  SZ001914   9424092.0  78393415.96  2001914         NaN         NaN

2019-02-27
trade finished
0:09:02.784713

{2001914, 2002359}

20190227
order finished
0:10:11.970597

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   5906665.0  49341446.85  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   5906665.0  49341446.85  2001914         NaN         NaN

2019-02-28
trade finished
0:07:16.955430

{2001914}

20190228
order finished
0:08:19.805707

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   4805943.0  39828301.92  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   4805943.0  39828301.92  2001914         NaN         NaN

2019-03-01
trade finished
0:07:00.608610

{2001914}

20190301
order finished
0:07:55.246419

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   7710606.0  65147437.72  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   7710606.0  65147437.72  2001914         NaN         NaN

2019-03-04
trade finished
0:09:23.672823

{2001914}

20190304
order finished
0:10:24.413305

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   6311950.0  53417863.37  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   6311950.0  53417863.37  2001914         NaN         NaN

2019-03-05
trade finished
0:09:06.583548

{2001914}

20190305
order finished
0:10:15.707598

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   8679376.0  75058252.34  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   8679376.0  75058252.34  2001914         NaN         NaN

2019-03-06
trade finished
0:10:42.249582

{2001914, 2002547}

20190306
order finished
0:12:38.713967

{2000725, 2000727, 2001914}

           ID    max_volume    max_amount     skey  cum_volume  cum_amount
266  SZ000725  2.034755e+09  8.579570e+09  2000725         NaN         NaN
268  SZ000727  3.246046e+08  1.133061e+09  2000727         NaN         NaN
457  SZ001914  1.082750e+07  9.679785e+07  2001914         NaN         NaN

           ID    max_volume    max_amount     skey  cum_volume  cum_amount
266  SZ000725  2.034755e+09  8.579570e+09  2000725         NaN         NaN
268  SZ000727  3.246046e+08  1.133061e+09  2000727         NaN         NaN
457  SZ001914  1.082750e+07  9.679785e+07  2001914         NaN         NaN

2019-03-07
trade finished
0:11:03.204515

{2001914}

20190307
order finished
0:12:09.321610

{2000725, 2001914}

           ID    max_volume    max_amount     skey  cum_volume  cum_amount
267  SZ000725  1.962622e+09  8.029918e+09  2000725         NaN         NaN
458  SZ001914  1.048368e+07  9.400900e+07  2001914         NaN         NaN

           ID    max_volume    max_amount     skey  cum_volume  cum_amount
267  SZ000725  1.962622e+09  8.029918e+09  2000725         NaN         NaN
458  SZ001914  1.048368e+07  9.400900e+07  2001914         NaN         NaN

2019-03-08
trade finished
0:11:39.997071

{2000776, 2001914}

20190308
order finished
0:12:42.646446

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
458  SZ001914   8480851.0  75329994.55  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
458  SZ001914   8480851.0  75329994.55  2001914         NaN         NaN

2019-03-11
trade finished
0:09:22.239657

{2001914}

20190311
order finished
0:10:22.109469

{2001914}

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
457   SZ001914  10455553.0  9.405915e+07  2001914         NaN           NaN
1219  SZ002774  10518900.0  1.102930e+08  2002774  24447453.0  1.496998e+08

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
457   SZ001914  10455553.0  9.405915e+07  2001914         NaN           NaN
1219  SZ002774  10518900.0  1.102930e+08  2002774  24447453.0  1.496998e+08

2019-03-12
trade finished
0:10:42.601171

{2001914}

20190312
order finished
0:11:54.459209

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
458  SZ001914  26093211.0  2.457382e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
458  SZ001914  26093211.0  2.457382e+08  2001914         NaN         NaN

2019-03-13
trade finished
0:10:29.621581

{2001914}

20190313
order finished
0:11:31.864830

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
458  SZ001914  12659253.0  1.126639e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
458  SZ001914  12659253.0  1.126639e+08  2001914         NaN         NaN

2019-03-14
trade finished
0:08:41.028923

{2001914}

20190314
order finished
0:09:41.159036

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
459  SZ001914   9240835.0  81738081.56  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
459  SZ001914   9240835.0  81738081.56  2001914         NaN         NaN

2019-03-15
trade finished
0:07:48.065633

{2001914}

20190315
order finished
0:08:49.017548

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
459  SZ001914   8638731.0  75941355.59  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
459  SZ001914   8638731.0  75941355.59  2001914         NaN         NaN

2019-03-18
trade finished
0:07:59.786272

{2001914}

20190318
order finished
0:08:50.696057

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
459  SZ001914   7288302.0  65109072.01  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
459  SZ001914   7288302.0  65109072.01  2001914         NaN         NaN

2019-03-19
trade finished
0:07:49.457908

{2001914}

20190319
order finished
0:08:49.436842

{2001914}

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
458  SZ001914   5245859.0  46131031.2  2001914         NaN         NaN

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
458  SZ001914   5245859.0  46131031.2  2001914         NaN         NaN

2019-03-20
trade finished
0:08:11.448914

{2001914}

20190320
order finished
0:10:13.037114

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
459  SZ001914   7586672.0  67126988.49  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
459  SZ001914   7586672.0  67126988.49  2001914         NaN         NaN

2019-03-21
trade finished
0:08:52.604054

{2001914}

20190321
order finished
0:10:01.565931

{2001914}

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
458  SZ001914   6182626.0  54117740.1  2001914         NaN         NaN

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
458  SZ001914   6182626.0  54117740.1  2001914         NaN         NaN

2019-03-22
trade finished
0:08:25.895021

{2001914}

20190322
order finished
0:09:33.750124

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   9919276.0  87900986.09  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   9919276.0  87900986.09  2001914         NaN         NaN

2019-03-25
trade finished
0:08:17.494892

{2001914, 2300059}

20190325
order finished
0:09:14.655939

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   6881838.0  59865043.08  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   6881838.0  59865043.08  2001914         NaN         NaN

2019-03-26
trade finished
0:09:38.536791

{2001914}

20190326
order finished
0:09:36.040089

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   3909085.0  33326082.76  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   3909085.0  33326082.76  2001914         NaN         NaN

2019-03-27
trade finished
0:07:36.417148

{2001914}

20190327
order finished
0:08:24.372098

{2001914}

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
453  SZ001914   5255599.0  45453324.0  2001914         NaN         NaN

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
453  SZ001914   5255599.0  45453324.0  2001914         NaN         NaN

2019-03-28
trade finished
0:07:41.745713

{2001914}

20190328
order finished
0:08:30.708761

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   5938098.0  51685286.79  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   5938098.0  51685286.79  2001914         NaN         NaN

2019-03-29
trade finished
0:08:36.157210

{2001914}

20190329
order finished
0:09:35.254738

{2001914}

            ID   max_volume    max_amount     skey   cum_volume    cum_amount
34    SZ000045   13427811.0  1.071925e+08  2000045   13425811.0  1.071764e+08
72    SZ000401   72341839.0  1.342355e+09  2000401   72339839.0  1.342318e+09
300   SZ000786   27254233.0  5.770755e+08  2000786   27253133.0  5.770523e+08
347   SZ000858   54871096.0  5.244032e+09  2000858   54870996.0  5.244022e+09
361   SZ000882   36784427.0  1.088856e+08  2000882   36782027.0  1.088785e+08
453   SZ001914   11091945.0  9.918482e+07  2001914          NaN           NaN
566   SZ002113   83849078.0  2.975916e+08  2002113   83813078.0  2.974541e+08
623   SZ002170   29482800.0  1.306044e+08  2002170   29482300.0  1.306021e+08
736   SZ002285   34821440.0  2.173244e+08  2002285   34820940.0  2.173212e+08
803   SZ002353   20913514.0  5.324100e+08  2002353   20913014.0  5.323972e+08
808   SZ002358   25970153.0  3.836479e+08  2002358   25968853.0  3.836287e+08
927   SZ002477  147524436.0  3.600260e+08  2002477  147522436.0  3.600211e+08
1025  SZ002576   19225033.0  2.837004e+08  2002576   19224533.0  2.836929e+08
1069  SZ002621    4050274.0  9.721337e+07  2002621    4049874.0  9.720371e+07
1304  SZ002872   15714565.0  1.689037e+08  2002872   15712765.0  1.688841e+08
1420  SZ300043   45602033.0  3.153321e+08  2300043   45590633.0  3.152529e+08
1451  SZ300075   17903392.0  2.441136e+08  2300075   17898392.0  2.440450e+08
1709  SZ300336   42885697.0  2.435772e+08  2300336   42873097.0  2.435049e+08
1738  SZ300366   20652446.0  1.923536e+08  2300366   20639554.0  1.922328e+08
1749  SZ300378   10543776.0  1.555884e+08  2300378   10542076.0  1.555634e+08

            ID   max_volume    max_amount     skey   cum_volume    cum_amount
34    SZ000045   13427811.0  1.071925e+08  2000045   13425811.0  1.071764e+08
72    SZ000401   72341839.0  1.342355e+09  2000401   72339839.0  1.342318e+09
300   SZ000786   27254233.0  5.770755e+08  2000786   27253133.0  5.770523e+08
347   SZ000858   54871096.0  5.244032e+09  2000858   54870996.0  5.244022e+09
361   SZ000882   36784427.0  1.088856e+08  2000882   36782027.0  1.088785e+08
453   SZ001914   11091945.0  9.918482e+07  2001914          NaN           NaN
566   SZ002113   83849078.0  2.975916e+08  2002113   83813078.0  2.974541e+08
623   SZ002170   29482800.0  1.306044e+08  2002170   29482300.0  1.306021e+08
736   SZ002285   34821440.0  2.173244e+08  2002285   34820940.0  2.173212e+08
803   SZ002353   20913514.0  5.324100e+08  2002353   20913014.0  5.323972e+08
808   SZ002358   25970153.0  3.836479e+08  2002358   25968853.0  3.836287e+08
927   SZ002477  147524436.0  3.600260e+08  2002477  147522436.0  3.600211e+08
1025  SZ002576   19225033.0  2.837004e+08  2002576   19224533.0  2.836929e+08
1069  SZ002621    4050274.0  9.721337e+07  2002621    4049874.0  9.720371e+07
1304  SZ002872   15714565.0  1.689037e+08  2002872   15712765.0  1.688841e+08
1420  SZ300043   45602033.0  3.153321e+08  2300043   45590633.0  3.152529e+08
1451  SZ300075   17903392.0  2.441136e+08  2300075   17898392.0  2.440450e+08
1709  SZ300336   42885697.0  2.435772e+08  2300336   42873097.0  2.435049e+08
1738  SZ300366   20652446.0  1.923536e+08  2300366   20639554.0  1.922328e+08
1749  SZ300378   10543776.0  1.555884e+08  2300378   10542076.0  1.555634e+08

2019-04-01
trade finished
0:09:39.470937

{2001914}

20190401
order finished
0:10:34.627978

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
453  SZ001914  17052868.0  1.584217e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
453  SZ001914  17052868.0  1.584217e+08  2001914         NaN         NaN

2019-04-02
trade finished
0:11:12.776342

{2001914}

20190402
order finished
0:11:18.789062

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
451  SZ001914  10894192.0  1.010551e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
451  SZ001914  10894192.0  1.010551e+08  2001914         NaN         NaN

2019-04-03
trade finished
0:09:12.759453

{2001914}

20190403
order finished
0:10:17.773561

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
452  SZ001914  12108005.0  1.135168e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
452  SZ001914  12108005.0  1.135168e+08  2001914         NaN         NaN

2019-04-04
trade finished
0:10:51.596573

{2001914}

20190404
order finished
0:10:55.343121

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
453  SZ001914  10178375.0  95437930.18  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
453  SZ001914  10178375.0  95437930.18  2001914         NaN         NaN

2019-04-08
trade finished
0:10:51.508615

{2001914}

20190408
order finished
0:11:01.187066

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   8275021.0  77198658.07  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   8275021.0  77198658.07  2001914         NaN         NaN

2019-04-09
trade finished
0:08:39.457636

{2001914}

20190409
order finished
0:09:52.491715

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
457  SZ001914   9847888.0  92914717.34  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
457  SZ001914   9847888.0  92914717.34  2001914         NaN         NaN

2019-04-10
trade finished
0:10:34.386620

{2001914}

20190410
order finished
0:10:12.509156

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   9506939.0  88749420.69  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   9506939.0  88749420.69  2001914         NaN         NaN

2019-04-11
trade finished
0:09:03.514759

{2001914}

20190411
order finished
0:09:47.877758

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
457  SZ001914  22227839.0  2.190968e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
457  SZ001914  22227839.0  2.190968e+08  2001914         NaN         NaN

2019-04-12
trade finished
0:07:32.511250

{2001914}

20190412
order finished
0:08:32.919287
2019-04-15
trade finished
0:07:58.566536
20190415
order finished
0:08:48.716355
2019-04-16
trade finished
0:09:05.384755

{2000688,
 2000806,
 2000828,
 2000829,
 2000888,
 2002448,
 2002461,
 2002464,
 2002465,
 2002466,
 2002469,
 2002470,
 2002473,
 2002477,
 2002482,
 2002484,
 2002485,
 2002498,
 2002502,
 2002503,
 2002520}

20190416
order finished
0:09:08.341844
2019-04-17
trade finished
0:08:39.856061
20190417
order finished
0:10:05.083656
2019-04-18
trade finished
0:08:20.505318
20190418
order finished
0:09:16.669881
2019-04-19
trade finished
0:08:02.196435
20190419
order finished
0:09:10.828191
2019-04-22
trade finished
0:08:23.391028
20190422
order finished
0:10:13.010815
2019-04-23
trade finished
0:08:23.196093
20190423
order finished
0:09:42.029019
2019-04-24
trade finished
0:08:47.406098
20190424
order finished
0:08:37.778638
2019-04-25
trade finished
0:08:38.303216
20190425
order finished
0:09:28.620423
2019-04-26
trade finished
0:07:46.995414
20190426
order finished
0:08:17.369645

{2001914}

            ID   max_volume    max_amount     skey   cum_volume    cum_amount
0     SZ000001  103069575.0  1.450714e+09  2000001  103054211.0  1.450499e+09
1     SZ000002   49838608.0  1.461313e+09  2000002   49829708.0  1.461052e+09
3     SZ000005   12837640.0  4.304549e+07  2000005   12832140.0  4.302713e+07
4     SZ000006   10676376.0  6.539414e+07  2000006   10675876.0  6.539106e+07
5     SZ000007   11207261.0  6.884942e+07  2000007   11202561.0  6.882183e+07
...        ...          ...           ...      ...          ...           ...
2115  SZ300767    3097742.0  1.288327e+08  2300767    3097142.0  1.288078e+08
2116  SZ300768   17583798.0  6.961938e+08  2300768   17580369.0  6.960597e+08
2117  SZ300769    3637072.0  3.665589e+08  2300769    3636972.0  3.665487e+08
2118  SZ300770    8614318.0  6.042905e+08  2300770    8613518.0  6.042345e+08
2119  SZ300771   13666428.0  9.036670e+08  2300771   13663028.0  9.034406e+08

[1565 rows x 6 columns]

            ID   max_volume    max_amount     skey   cum_volume    cum_amount
0     SZ000001  103069575.0  1.450714e+09  2000001  103054211.0  1.450499e+09
1     SZ000002   49838608.0  1.461313e+09  2000002   49829708.0  1.461052e+09
3     SZ000005   12837640.0  4.304549e+07  2000005   12832140.0  4.302713e+07
4     SZ000006   10676376.0  6.539414e+07  2000006   10675876.0  6.539106e+07
5     SZ000007   11207261.0  6.884942e+07  2000007   11202561.0  6.882183e+07
...        ...          ...           ...      ...          ...           ...
2115  SZ300767    3097742.0  1.288327e+08  2300767    3097142.0  1.288078e+08
2116  SZ300768   17583798.0  6.961938e+08  2300768   17580369.0  6.960597e+08
2117  SZ300769    3637072.0  3.665589e+08  2300769    3636972.0  3.665487e+08
2118  SZ300770    8614318.0  6.042905e+08  2300770    8613518.0  6.042345e+08
2119  SZ300771   13666428.0  9.036670e+08  2300771   13663028.0  9.034406e+08

[1565 rows x 6 columns]

2019-04-29
trade finished
0:07:40.948678

{2001914}

20190429
order finished
0:08:21.427540

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
449  SZ001914  57674713.0  6.532201e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
449  SZ001914  57674713.0  6.532201e+08  2001914         NaN         NaN

2019-04-30
trade finished
0:06:20.087079

{2001914}

20190430
order finished
0:07:04.365068

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
457  SZ001914  77651856.0  889096250.2  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
457  SZ001914  77651856.0  889096250.2  2001914         NaN         NaN

2019-05-06
trade finished
0:07:16.755407

{2001914}

20190506
order finished
0:07:58.230435

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
456  SZ001914  43525757.0  4.891206e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
456  SZ001914  43525757.0  4.891206e+08  2001914         NaN         NaN

2019-05-07
trade finished
0:06:59.043471

{2001914}

20190507
order finished
0:07:34.953524

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914  31791054.0  3.501744e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914  31791054.0  3.501744e+08  2001914         NaN         NaN

2019-05-08
trade finished
0:06:53.119430

{2001914}

20190508
order finished
0:07:35.092467

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914  30295011.0  3.428115e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914  30295011.0  3.428115e+08  2001914         NaN         NaN

2019-05-09
trade finished
0:06:05.000371

{2001914}

20190509
order finished
0:06:45.022313

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914  50088950.0  600675204.8  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914  50088950.0  600675204.8  2001914         NaN         NaN

2019-05-10
trade finished
0:07:44.922772

{2001914}

20190510
order finished
0:08:10.340446

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914  31790642.0  376899751.7  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914  31790642.0  376899751.7  2001914         NaN         NaN

2019-05-13
trade finished
0:06:29.089942

{2001914}

20190513
order finished
0:07:06.465376

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914  15005863.0  1.767003e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914  15005863.0  1.767003e+08  2001914         NaN         NaN

2019-05-14
trade finished
0:06:27.029072

{2001914}

20190514
order finished
0:07:14.497674

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
455  SZ001914  13964505.0  1.644749e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
455  SZ001914  13964505.0  1.644749e+08  2001914         NaN         NaN

2019-05-15
trade finished
0:06:37.820582

{2001914}

20190515
order finished
0:07:16.133071

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914  21884444.0  2.533430e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914  21884444.0  2.533430e+08  2001914         NaN         NaN

2019-05-16
trade finished
0:07:01.453350

{2001914}

20190516
order finished
0:07:50.323592

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914  12182747.0  1.432742e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914  12182747.0  1.432742e+08  2001914         NaN         NaN

2019-05-17
trade finished
0:07:48.300005

{2001914}

20190517
order finished
0:08:54.936711

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   6184371.0  69685220.56  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   6184371.0  69685220.56  2001914         NaN         NaN

2019-05-20
trade finished
0:07:03.848939

{2001914}

20190520
order finished
0:07:35.467341

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   8357128.0  95074475.32  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   8357128.0  95074475.32  2001914         NaN         NaN

2019-05-21
trade finished
0:06:55.954064

{2001914, 2002547}

20190521
order finished
0:09:03.254455

{2001914, 2002600}

            ID   max_volume    max_amount     skey  cum_volume  cum_amount
455   SZ001914    4542366.0  5.103555e+07  2001914         NaN         NaN
1048  SZ002600  346429636.0  2.297538e+09  2002600         NaN         NaN

            ID   max_volume    max_amount     skey  cum_volume  cum_amount
455   SZ001914    4542366.0  5.103555e+07  2001914         NaN         NaN
1048  SZ002600  346429636.0  2.297538e+09  2002600         NaN         NaN

2019-05-22
trade finished
0:06:41.572543

{2001914}

20190522
order finished
0:08:05.082104

{2001914}

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
455  SZ001914   7700732.0  83380161.8  2001914         NaN         NaN

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
455  SZ001914   7700732.0  83380161.8  2001914         NaN         NaN

2019-05-23
trade finished
0:07:20.385693

{2001914}

20190523
order finished
0:08:05.439148

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   5185210.0  55780193.15  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   5185210.0  55780193.15  2001914         NaN         NaN

2019-05-24
trade finished
0:06:04.031987

{2000795, 2001914}

20190524
order finished
0:07:36.566001

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   6262275.0  66640290.41  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   6262275.0  66640290.41  2001914         NaN         NaN

2019-05-27
trade finished
0:06:30.149108

{2000066, 2001914, 2002668}

20190527
order finished
0:07:15.140727

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
455  SZ001914   9474418.0  1.027646e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
455  SZ001914   9474418.0  1.027646e+08  2001914         NaN         NaN

2019-05-28
trade finished
0:07:15.055954

{2001914}

20190528
order finished
0:07:28.571791

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   7948613.0  88067920.86  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   7948613.0  88067920.86  2001914         NaN         NaN

2019-05-29
trade finished
0:06:18.165172

{2001914}

20190529
order finished
0:08:02.354402

{2001914}

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
456  SZ001914   3978952.0  43319594.2  2001914         NaN         NaN

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
456  SZ001914   3978952.0  43319594.2  2001914         NaN         NaN

2019-05-30
trade finished
0:06:33.952930

{2001914}

20190530
order finished
0:07:23.504349

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   6494864.0  71812345.88  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   6494864.0  71812345.88  2001914         NaN         NaN

2019-05-31
trade finished
0:08:00.138331

{2001914}

20190531
order finished
0:07:12.345207

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   5164386.0  57027078.96  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   5164386.0  57027078.96  2001914         NaN         NaN

2019-06-03
trade finished
0:06:55.950074

{2001914}

20190603
order finished
0:08:40.239036

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   4206537.0  45367872.74  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   4206537.0  45367872.74  2001914         NaN         NaN

2019-06-04
trade finished
0:06:35.682303

{2001914}

20190604
order finished
0:07:15.662332

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   4275747.0  45985584.88  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   4275747.0  45985584.88  2001914         NaN         NaN

2019-06-05
trade finished
0:06:25.687047

{2001914}

20190605
order finished
0:06:48.487042

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   6494107.0  66315909.46  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   6494107.0  66315909.46  2001914         NaN         NaN

2019-06-06
trade finished
0:06:17.508929

{2001914}

20190606
order finished
0:08:04.126658

{2001914}

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
454  SZ001914   8682107.0  87934873.6  2001914         NaN         NaN

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
454  SZ001914   8682107.0  87934873.6  2001914         NaN         NaN

2019-06-10
trade finished
0:05:42.489627

{2001914}

20190610
order finished
0:07:02.201348

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   7725420.0  79422382.17  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   7725420.0  79422382.17  2001914         NaN         NaN

2019-06-11
trade finished
0:08:10.786840

{2001914}

20190611
order finished
0:08:07.428824

{2001914}

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
455  SZ001914   7639001.0  76981681.7  2001914         NaN         NaN

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
455  SZ001914   7639001.0  76981681.7  2001914         NaN         NaN

2019-06-12
trade finished
0:07:11.079593

{2001914}

20190612
order finished
0:08:02.847082

{2001914}

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
455  SZ001914   3433400.0  34393444.0  2001914         NaN         NaN

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
455  SZ001914   3433400.0  34393444.0  2001914         NaN         NaN

2019-06-13
trade finished
0:06:38.905678

{2001914}

20190613
order finished
0:07:25.278602

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   4543212.0  45969302.79  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   4543212.0  45969302.79  2001914         NaN         NaN

2019-06-14
trade finished
0:06:37.669984

{2001914}

20190614
order finished
0:07:24.715110

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   5436866.0  54626593.24  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   5436866.0  54626593.24  2001914         NaN         NaN

2019-06-17
trade finished
0:06:48.594754

{2001914}

20190617
order finished
0:06:21.043471

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   5318412.0  53426993.17  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   5318412.0  53426993.17  2001914         NaN         NaN

2019-06-18
trade finished
0:05:34.054197

{2001914}

20190618
order finished
0:06:08.541921

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
457  SZ001914   9425761.0  97580775.85  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
457  SZ001914   9425761.0  97580775.85  2001914         NaN         NaN

2019-06-19
trade finished
0:06:24.078350

{2001914}

20190619
order finished
0:07:14.960211

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
457  SZ001914   7672162.0  81511763.44  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
457  SZ001914   7672162.0  81511763.44  2001914         NaN         NaN

2019-06-20
trade finished
0:07:15.189596

{2001914}

20190620
order finished
0:08:10.022883

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
457  SZ001914   6406300.0  70021509.45  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
457  SZ001914   6406300.0  70021509.45  2001914         NaN         NaN

2019-06-21
trade finished
0:07:38.507207

{2001914}

20190621
order finished
0:09:35.264808

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
457  SZ001914   4937723.0  54363507.15  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
457  SZ001914   4937723.0  54363507.15  2001914         NaN         NaN

2019-06-24
trade finished
0:06:35.223531

{2001914}

20190624
order finished
0:07:25.310516

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
456  SZ001914  22381983.0  2.655138e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
456  SZ001914  22381983.0  2.655138e+08  2001914         NaN         NaN

2019-06-25
trade finished
0:06:32.368170

{2001914}

20190625
order finished
0:07:39.636187

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
456  SZ001914  10623540.0  1.249925e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
456  SZ001914  10623540.0  1.249925e+08  2001914         NaN         NaN

2019-06-26
trade finished
0:07:02.197359

{2001914}

20190626
order finished
0:07:06.151778

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
456  SZ001914  15288419.0  1.854266e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
456  SZ001914  15288419.0  1.854266e+08  2001914         NaN         NaN

2019-06-27
trade finished
0:06:18.147220

{2001914}

20190627
order finished
0:08:47.360981

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   7775297.0  93650491.05  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   7775297.0  93650491.05  2001914         NaN         NaN

2019-06-28
trade finished
0:05:53.866187

{2001914}

20190628
order finished
0:06:51.192803

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
457  SZ001914  13454384.0  1.660814e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
457  SZ001914  13454384.0  1.660814e+08  2001914         NaN         NaN

2019-07-01
trade finished
0:08:24.244831

{2001914}

20190701
order finished
0:07:54.399685

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
457  SZ001914   7264822.0  90656008.57  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
457  SZ001914   7264822.0  90656008.57  2001914         NaN         NaN

2019-07-02
trade finished
0:06:54.616641

{2001914}

20190702
order finished
0:07:48.471547

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
457  SZ001914  13841465.0  1.662719e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
457  SZ001914  13841465.0  1.662719e+08  2001914         NaN         NaN

2019-07-03
trade finished
0:06:15.826430

{2001914}

20190703
order finished
0:07:03.313373

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
457  SZ001914   7968921.0  94882874.62  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
457  SZ001914   7968921.0  94882874.62  2001914         NaN         NaN

2019-07-04
trade finished
0:05:46.961662

{2001914}

20190704
order finished
0:06:40.756725

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
457  SZ001914   7947345.0  92629231.14  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
457  SZ001914   7947345.0  92629231.14  2001914         NaN         NaN

2019-07-05
trade finished
0:05:10.400485

{2001914}

20190705
order finished
0:06:03.273018

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
456  SZ001914  10011284.0  1.158416e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
456  SZ001914  10011284.0  1.158416e+08  2001914         NaN         NaN

2019-07-08
trade finished
0:07:15.453890

{2001914}

20190708
order finished
0:07:16.425290

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   6403721.0  73868841.92  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   6403721.0  73868841.92  2001914         NaN         NaN

2019-07-09
trade finished
0:05:13.371535

{2001914}

20190709
order finished
0:05:53.906081

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   5177838.0  59249696.28  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   5177838.0  59249696.28  2001914         NaN         NaN

2019-07-10
trade finished
0:05:47.969964

{2001914}

20190710
order finished
0:05:43.492941

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   8185101.0  95327846.41  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   8185101.0  95327846.41  2001914         NaN         NaN

2019-07-11
trade finished
0:05:09.591651

{2001914}

20190711
order finished
0:05:54.490516

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   7415908.0  88343362.64  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   7415908.0  88343362.64  2001914         NaN         NaN

2019-07-12
trade finished
0:05:19.764430

{2001914}

20190712
order finished
0:06:05.710497

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   5579829.0  67343693.03  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   5579829.0  67343693.03  2001914         NaN         NaN

2019-07-15
trade finished
0:06:56.049808

{2001914}

20190715
order finished
0:07:27.117681

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914  14335857.0  1.817690e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914  14335857.0  1.817690e+08  2001914         NaN         NaN

2019-07-16
trade finished
0:05:51.530437

{2001914}

20190716
order finished
0:06:46.282829

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   6822341.0  87079519.26  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   6822341.0  87079519.26  2001914         NaN         NaN

2019-07-17
trade finished
0:06:36.681630

{2001914}

20190717
order finished
0:06:45.145981

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   5173359.0  65589678.67  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   5173359.0  65589678.67  2001914         NaN         NaN

2019-07-18
trade finished
0:06:37.325906

{2001914}

20190718
order finished
0:06:28.525452

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   5171022.0  65977649.41  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   5171022.0  65977649.41  2001914         NaN         NaN

2019-07-19
trade finished
0:05:24.642379

{2001914}

20190719
order finished
0:06:13.644269

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   5961945.0  75578639.06  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   5961945.0  75578639.06  2001914         NaN         NaN

2019-07-22
trade finished
0:05:49.054062

{2001914}

20190722
order finished
0:06:56.139567

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   4608473.0  57436710.41  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   4608473.0  57436710.41  2001914         NaN         NaN

2019-07-23
trade finished
0:05:11.827668

{2001914}

20190723
order finished
0:05:48.225671

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   5885004.0  73672669.34  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   5885004.0  73672669.34  2001914         NaN         NaN

2019-07-24
trade finished
0:05:43.876916

{2001914}

20190724
order finished
0:06:31.039724

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   4105122.0  51644757.24  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   4105122.0  51644757.24  2001914         NaN         NaN

2019-07-25
trade finished
0:05:46.276494

{2001914}

20190725
order finished
0:06:21.670793

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
453  SZ001914   9015921.0  1.179235e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
453  SZ001914   9015921.0  1.179235e+08  2001914         NaN         NaN

2019-07-26
trade finished
0:05:40.815107

{2001914}

20190726
order finished
0:06:21.136223

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   7043940.0  93880152.03  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   7043940.0  93880152.03  2001914         NaN         NaN

2019-07-29
trade finished
0:05:04.147216

{2001914}

20190729
order finished
0:05:50.756507

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   5877729.0  78702267.45  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   5877729.0  78702267.45  2001914         NaN         NaN

2019-07-30
trade finished
0:06:17.938779

{2001914}

20190730
order finished
0:06:09.864381

{2001914}

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
456  SZ001914   6214592.0  81674183.7  2001914         NaN         NaN

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
456  SZ001914   6214592.0  81674183.7  2001914         NaN         NaN

2019-07-31
trade finished
0:05:17.444638

{2001914}

20190731
order finished
0:07:16.664650

{2001914}

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
456  SZ001914   6191700.0  79419488.1  2001914         NaN         NaN

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
456  SZ001914   6191700.0  79419488.1  2001914         NaN         NaN

2019-08-01
trade finished
0:05:25.959853

{2001914}

20190801
order finished
0:06:15.713732

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
456  SZ001914   7973378.0  1.004562e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
456  SZ001914   7973378.0  1.004562e+08  2001914         NaN         NaN

2019-08-02
trade finished
0:06:10.271768

{2000725, 2001914}

20190802
order finished
0:06:45.785272

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   5688349.0  70406702.64  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   5688349.0  70406702.64  2001914         NaN         NaN

2019-08-05
trade finished
0:05:49.124647

{2001914}

20190805
order finished
0:06:34.181320

{2001914}

            ID  max_volume    max_amount     skey  cum_volume   cum_amount
456   SZ001914  14622796.0  1.774794e+08  2001914         NaN          NaN
1711  SZ300329   2474835.0  1.712930e+07  2300329   5991545.0  43347562.05

            ID  max_volume    max_amount     skey  cum_volume   cum_amount
456   SZ001914  14622796.0  1.774794e+08  2001914         NaN          NaN
1711  SZ300329   2474835.0  1.712930e+07  2300329   5991545.0  43347562.05

2019-08-06
trade finished
0:06:52.897242

{2001914}

20190806
order finished
0:07:47.388920

{2001914, 2002966}

            ID   max_volume    max_amount     skey  cum_volume  cum_amount
456   SZ001914   11267411.0  1.441497e+08  2001914         NaN         NaN
1387  SZ002966  156395790.0  2.105559e+09  2002966         NaN         NaN

            ID   max_volume    max_amount     skey  cum_volume  cum_amount
456   SZ001914   11267411.0  1.441497e+08  2001914         NaN         NaN
1387  SZ002966  156395790.0  2.105559e+09  2002966         NaN         NaN

2019-08-07
trade finished
0:05:42.428790

{2001914}

20190807
order finished
0:06:24.182073

{2001914}

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
456   SZ001914   7537679.0  9.623207e+07  2001914         NaN           NaN
507   SZ002049  24289973.0  1.113791e+09  2002049  24288973.0  1.113746e+09
576   SZ002119  61294534.0  8.635270e+08  2002119  61293334.0  8.635108e+08
722   SZ002267   3699322.0  2.669059e+07  2002267   3699122.0  2.668914e+07
753   SZ002298   1841153.0  1.247399e+07  2002298   1831153.0  1.240629e+07
1396  SZ300009   3674350.0  5.415754e+07  2300009   3673850.0  5.415016e+07
1543  SZ300159   7387386.0  3.183843e+07  2300159   7386386.0  3.183413e+07
1735  SZ300353  14325221.0  1.834571e+08  2300353  14324221.0  1.834443e+08
2070  SZ300697  11341656.0  1.666812e+08  2300697  11341256.0  1.666753e+08

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
456   SZ001914   7537679.0  9.623207e+07  2001914         NaN           NaN
507   SZ002049  24289973.0  1.113791e+09  2002049  24288973.0  1.113746e+09
576   SZ002119  61294534.0  8.635270e+08  2002119  61293334.0  8.635108e+08
722   SZ002267   3699322.0  2.669059e+07  2002267   3699122.0  2.668914e+07
753   SZ002298   1841153.0  1.247399e+07  2002298   1831153.0  1.240629e+07
1396  SZ300009   3674350.0  5.415754e+07  2300009   3673850.0  5.415016e+07
1543  SZ300159   7387386.0  3.183843e+07  2300159   7386386.0  3.183413e+07
1735  SZ300353  14325221.0  1.834571e+08  2300353  14324221.0  1.834443e+08
2070  SZ300697  11341656.0  1.666812e+08  2300697  11341256.0  1.666753e+08

2019-08-08
trade finished
0:05:20.236169

{2001914}

20190808
order finished
0:05:58.036030

{2001914}

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
456  SZ001914   5140408.0  64388890.4  2001914         NaN         NaN

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
456  SZ001914   5140408.0  64388890.4  2001914         NaN         NaN

2019-08-09
trade finished
0:05:33.223419

{2001914}

20190809
order finished
0:06:17.118972

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
456  SZ001914  10103765.0  1.300337e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
456  SZ001914  10103765.0  1.300337e+08  2001914         NaN         NaN

2019-08-12
trade finished
0:05:59.425313

{2001914}

20190812
order finished
0:05:42.120128

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   7155893.0  93773540.98  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   7155893.0  93773540.98  2001914         NaN         NaN

2019-08-13
trade finished
0:05:11.225522

{2001914}

20190813
order finished
0:05:49.292756

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
453  SZ001914   4504466.0  59662398.82  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
453  SZ001914   4504466.0  59662398.82  2001914         NaN         NaN

2019-08-14
trade finished
0:05:40.038790

{2001914}

20190814
order finished
0:06:22.483089

{2001914}

           ID  max_volume   max_amount     skey  cum_volume   cum_amount
454  SZ001914   5132156.0  68286931.52  2001914         NaN          NaN
729  SZ002276   8829125.0  44692457.48  2002276  10779124.0  164654454.8

           ID  max_volume   max_amount     skey  cum_volume   cum_amount
454  SZ001914   5132156.0  68286931.52  2001914         NaN          NaN
729  SZ002276   8829125.0  44692457.48  2002276  10779124.0  164654454.8

2019-08-15
trade finished
0:05:57.409823

{2001914, 2002463, 2002475}

20190815
order finished
0:06:55.675384

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   4356077.0  58164721.63  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   4356077.0  58164721.63  2001914         NaN         NaN

2019-08-16
trade finished
0:06:03.992938

{2001914}

20190816
order finished
0:07:13.345530

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
453  SZ001914   5321195.0  71961808.06  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
453  SZ001914   5321195.0  71961808.06  2001914         NaN         NaN

2019-08-19
trade finished
0:07:08.075631

{2000063, 2001914}

20190819
order finished
0:07:50.941443

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
453  SZ001914  10076869.0  1.312309e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
453  SZ001914  10076869.0  1.312309e+08  2001914         NaN         NaN

2019-08-20
trade finished
0:07:15.352162

{2001914}

20190820
order finished
0:07:47.158850

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
453  SZ001914   9789645.0  1.299213e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
453  SZ001914   9789645.0  1.299213e+08  2001914         NaN         NaN

2019-08-21
trade finished
0:06:28.163927

{2001914}

20190821
order finished
0:07:18.007974

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
453  SZ001914   8615233.0  1.125088e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
453  SZ001914   8615233.0  1.125088e+08  2001914         NaN         NaN

2019-08-22
trade finished
0:06:33.114174

{2001914}

20190822
order finished
0:07:17.289441

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
452  SZ001914   3910013.0  51096707.86  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
452  SZ001914   3910013.0  51096707.86  2001914         NaN         NaN

2019-08-23
trade finished
0:07:28.655798

{2001914}

20190823
order finished
0:07:12.613936

{2001914}

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
252   SZ000709  20590763.0  5.249659e+07  2000709  20584663.0  5.248103e+07
350   SZ000858  28321987.0  3.616949e+09  2000858  28321887.0  3.616936e+09
423   SZ000963  28401006.0  8.724267e+08  2000963  28400306.0  8.724054e+08
443   SZ000988  72863917.0  1.270911e+09  2000988  72863617.0  1.270906e+09
454   SZ001914   8607301.0  1.216483e+08  2001914         NaN           NaN
472   SZ002016   2676028.0  1.977774e+07  2002016   2675128.0  1.977108e+07
495   SZ002040  17156170.0  1.381980e+08  2002040  17155880.0  1.381956e+08
1001  SZ002555  14637890.0  2.291602e+08  2002555  14637790.0  2.291586e+08
1507  SZ300127  36265839.0  8.779734e+08  2300127  36265739.0  8.779710e+08
1744  SZ300367  16633744.0  8.832309e+07  2300367  16633344.0  8.832095e+07
1745  SZ300368  13684012.0  1.013055e+08  2300368  13682812.0  1.012966e+08
2098  SZ300732    934764.0  1.621763e+07  2300732    934664.0  1.621590e+07

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
252   SZ000709  20590763.0  5.249659e+07  2000709  20584663.0  5.248103e+07
350   SZ000858  28321987.0  3.616949e+09  2000858  28321887.0  3.616936e+09
423   SZ000963  28401006.0  8.724267e+08  2000963  28400306.0  8.724054e+08
443   SZ000988  72863917.0  1.270911e+09  2000988  72863617.0  1.270906e+09
454   SZ001914   8607301.0  1.216483e+08  2001914         NaN           NaN
472   SZ002016   2676028.0  1.977774e+07  2002016   2675128.0  1.977108e+07
495   SZ002040  17156170.0  1.381980e+08  2002040  17155880.0  1.381956e+08
1001  SZ002555  14637890.0  2.291602e+08  2002555  14637790.0  2.291586e+08
1507  SZ300127  36265839.0  8.779734e+08  2300127  36265739.0  8.779710e+08
1744  SZ300367  16633744.0  8.832309e+07  2300367  16633344.0  8.832095e+07
1745  SZ300368  13684012.0  1.013055e+08  2300368  13682812.0  1.012966e+08
2098  SZ300732    934764.0  1.621763e+07  2300732    934664.0  1.621590e+07

2019-08-26
trade finished
0:07:30.286203

{2001914}

20190826
order finished
0:07:08.891448

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914  44360710.0  680580296.2  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914  44360710.0  680580296.2  2001914         NaN         NaN

2019-08-27
trade finished
0:07:14.722466

{2001914}

20190827
order finished
0:08:03.064481

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
455  SZ001914  21272123.0  3.244748e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
455  SZ001914  21272123.0  3.244748e+08  2001914         NaN         NaN

2019-08-28
trade finished
0:06:45.234867

{2001914}

20190828
order finished
0:07:44.857217

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
455  SZ001914  12850594.0  1.971260e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
455  SZ001914  12850594.0  1.971260e+08  2001914         NaN         NaN

2019-08-29
trade finished
0:06:52.286130

{2000651, 2001914}

20190829
order finished
0:07:31.221599

{2001914, 2003816}

            ID    max_volume    max_amount     skey  cum_volume  cum_amount
456   SZ001914  1.739077e+07  2.692377e+08  2001914         NaN         NaN
1387  SZ003816  1.263080e+09  6.270396e+09  2003816         NaN         NaN

            ID    max_volume    max_amount     skey  cum_volume  cum_amount
456   SZ001914  1.739077e+07  2.692377e+08  2001914         NaN         NaN
1387  SZ003816  1.263080e+09  6.270396e+09  2003816         NaN         NaN

2019-08-30
trade finished
0:07:17.759720

{2001914, 2003816}

20190830
order finished
0:08:09.331863

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
456  SZ001914  12797295.0  1.982176e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
456  SZ001914  12797295.0  1.982176e+08  2001914         NaN         NaN

2019-09-02
trade finished
0:07:24.823833

{2001914}

20190902
order finished
0:08:41.274266
empty data
G:\KR\2019\SZ\20190903\tick\300298.csv

{2001914, 2300298}

            ID  max_volume    max_amount     skey  cum_volume  cum_amount
456   SZ001914  10681770.0  1.700114e+08  2001914         NaN         NaN
1681  SZ300298   2178058.0  2.504582e+07  2300298         NaN         NaN

            ID  max_volume    max_amount     skey  cum_volume  cum_amount
456   SZ001914  10681770.0  1.700114e+08  2001914         NaN         NaN
1681  SZ300298   2178058.0  2.504582e+07  2300298         NaN         NaN

2019-09-03
trade finished
0:07:14.488029

{2001914}

20190903
order finished
0:09:15.374028

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
456  SZ001914   7887792.0  1.245354e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
456  SZ001914   7887792.0  1.245354e+08  2001914         NaN         NaN

2019-09-04
trade finished
0:07:32.382594

{2001914}

20190904
order finished
0:08:27.246266

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
456  SZ001914   9676916.0  1.513843e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
456  SZ001914   9676916.0  1.513843e+08  2001914         NaN         NaN

2019-09-05
trade finished
0:09:01.198224

{2001914}

20190905
order finished
0:09:59.729353

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   7551167.0  117094451.6  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
456  SZ001914   7551167.0  117094451.6  2001914         NaN         NaN

2019-09-06
trade finished
0:07:38.094780

{2001914}

20190906
order finished
0:08:48.374733

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
456  SZ001914   7641315.0  1.192731e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
456  SZ001914   7641315.0  1.192731e+08  2001914         NaN         NaN

2019-09-09
trade finished
0:08:33.589828

{2001914}

20190909
order finished
0:09:40.210575

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   6288530.0  96444746.32  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   6288530.0  96444746.32  2001914         NaN         NaN

2019-09-10
trade finished
0:09:28.379788

{2001914}

20190910
order finished
0:09:13.293594

{2001914}

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
166  SZ000589  68632846.0  3.329489e+08  2000589  68632746.0  3.329484e+08
454  SZ001914   4455503.0  6.818166e+07  2001914         NaN           NaN
755  SZ002303  20238976.0  1.060309e+08  2002303  20234576.0  1.060074e+08

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
166  SZ000589  68632846.0  3.329489e+08  2000589  68632746.0  3.329484e+08
454  SZ001914   4455503.0  6.818166e+07  2001914         NaN           NaN
755  SZ002303  20238976.0  1.060309e+08  2002303  20234576.0  1.060074e+08

2019-09-11
trade finished
0:09:21.362007

{2001914}

20190911
order finished
0:08:55.968762

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   5298452.0  80955587.03  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   5298452.0  80955587.03  2001914         NaN         NaN

2019-09-12
trade finished
0:07:54.848842

{2001914}

20190912
order finished
0:08:25.749804

{2001914}

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
69   SZ000301   6854051.0  3.758186e+07  2000301   6853822.0  3.758061e+07
273  SZ000732  20243608.0  1.326762e+08  2000732  20242408.0  1.326683e+08
454  SZ001914   4908200.0  7.504454e+07  2001914         NaN           NaN
464  SZ002008  47241263.0  1.663576e+09  2002008  47241163.0  1.663573e+09

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
69   SZ000301   6854051.0  3.758186e+07  2000301   6853822.0  3.758061e+07
273  SZ000732  20243608.0  1.326762e+08  2000732  20242408.0  1.326683e+08
454  SZ001914   4908200.0  7.504454e+07  2001914         NaN           NaN
464  SZ002008  47241263.0  1.663576e+09  2002008  47241163.0  1.663573e+09

2019-09-16
trade finished
0:07:11.591781

{2001914}

20190916
order finished
0:08:10.668550

{2001914}

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
455  SZ001914   4116700.0  62232333.0  2001914         NaN         NaN

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
455  SZ001914   4116700.0  62232333.0  2001914         NaN         NaN

2019-09-17
trade finished
0:07:55.133721

{2001914}

20190917
order finished
0:08:38.879674

{2001914}

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
455  SZ001914   4834500.0  73042431.0  2001914         NaN         NaN

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
455  SZ001914   4834500.0  73042431.0  2001914         NaN         NaN

2019-09-18
trade finished
0:06:33.559814

{2001914}

20190918
order finished
0:07:50.631766

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   3357832.0  51027297.76  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   3357832.0  51027297.76  2001914         NaN         NaN

2019-09-19
trade finished
0:06:38.575332

{2001914}

20190919
order finished
0:07:37.144322

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
455  SZ001914  11414420.0  1.825820e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
455  SZ001914  11414420.0  1.825820e+08  2001914         NaN         NaN

2019-09-20
trade finished
0:06:48.791818

{2001914}

20190920
order finished
0:08:38.309200

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   9475079.0  154710762.9  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   9475079.0  154710762.9  2001914         NaN         NaN

2019-09-23
trade finished
0:07:26.251000

{2001914}

20190923
order finished
0:07:39.849897

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
455  SZ001914  10267540.0  1.706457e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
455  SZ001914  10267540.0  1.706457e+08  2001914         NaN         NaN

2019-09-24
trade finished
0:07:15.669983

{2001914}

20190924
order finished
0:08:08.209785

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914   7423000.0  1.240191e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914   7423000.0  1.240191e+08  2001914         NaN         NaN

2019-09-25
trade finished
0:07:16.329657

{2001914}

20190925
order finished
0:07:54.534987

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
456  SZ001914  10584496.0  1.798915e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
456  SZ001914  10584496.0  1.798915e+08  2001914         NaN         NaN

2019-09-26
trade finished
0:07:24.122695

{2001914}

20190926
order finished
0:09:28.498514

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
456  SZ001914  12168232.0  2.083130e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
456  SZ001914  12168232.0  2.083130e+08  2001914         NaN         NaN

2019-09-27
trade finished
0:06:07.060973

{2001914}

20190927
order finished
0:06:52.070334

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914   7920893.0  1.366788e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914   7920893.0  1.366788e+08  2001914         NaN         NaN

2019-09-30
trade finished
0:05:24.077859

{2001914}

20190930
order finished
0:06:07.976433

In [141]:
kk = pd.read_csv(r"G:\KR\2019\SZ\20190128\tick\002881.csv")
kk["Volume"] = np.where(kk["ExecType"] == '4', 0, kk["Qty"])
kk["cum_volume"] = kk["Volume"].cumsum()
kk[(kk["TransactTime"] > 20190128093000000) & (kk["ExecType"] == 'F')][["TransactTime", "ExecType", "Price", "Qty", "BidApplSeqNum", "OfferApplSeqNum"]].head(5)

         TransactTime ExecType  Price   Qty  BidApplSeqNum  OfferApplSeqNum
20  20190128093000120        F  10.51   300         191437           152954
21  20190128093000120        F  10.51   200         191437           185041
22  20190128093000250        F  10.51   100         202928           185041
23  20190128093000280        F  10.51  1500         204625           185041
24  20190128093000390        F  10.51   100         210645           185041

In [131]:
kk1 = pd.read_csv(r"G:\KR\2019\SH\20190218\snapshot\Level_2\600128.csv")
display(np.sort(kk1["HighPx"].unique()))
display(np.sort(kk1["LowPx"].unique()))
kk1[kk1["QuotTime"] > 20190218093000000][["QuotTime", "Volume", "OpenPx", "HighPx", "LowPx", "PreClosePx", "LastPx"]].head(5)

array([0.  , 2.94, 2.97, 2.98, 2.99])

array([0.  , 2.94])

             QuotTime  Volume  OpenPx  HighPx  LowPx  PreClosePx  LastPx
75  20190218093001000   76000    2.94    2.94   2.94        2.94    2.94
76  20190218093005000  429600    2.94    2.97   2.94        2.94    2.95
77  20190218093008000  439500    2.94    2.97   2.94        2.94    2.95
78  20190218093014000  441500    2.94    2.97   2.94        2.94    2.96
79  20190218093017000  441500    2.94    2.97   2.94        2.94    2.96

In [2]:
import pandas as pd
import random
import numpy as np
import glob
import os
from unrar import rarfile
import py7zr
import pickle
import datetime
import time
pd.set_option("max_columns", 200)

startTm = datetime.datetime.now()
readPath = r'\\192.168.10.30\Kevin_zhenyu\day_stock_20200424\***'
dataPathLs = np.array(glob.glob(readPath))
dataPathLs = dataPathLs[[np.array([os.path.basename(i).split('.')[0][:2] == 'SZ' for i in dataPathLs])]]
db = pd.DataFrame()
for p in dataPathLs:
    dayData = pd.read_csv(p, compression='gzip')
    db = pd.concat([db, dayData])
print(datetime.datetime.now() - startTm)

year = "2019"
startDate = '20191008'
endDate = '20191231'
readPath = 'E:\\KR\\' + year + '\\SZ\\***'
dataPathLs = np.array(glob.glob(readPath))
dateLs = np.array([os.path.basename(i) for i in dataPathLs])
dataPathLs = dataPathLs[(dateLs >= startDate) & (dateLs <= endDate)]

for data in dataPathLs:
    
    startTm = datetime.datetime.now()
    
    readPath = data + '\\tick\\***'
    dataPathLs = np.array(glob.glob(readPath))
    dateLs = np.array([int(os.path.basename(i).split('.')[0]) for i in dataPathLs])
    dataPathLs = dataPathLs[(dateLs < 4000) | ((dateLs > 300000) & (dateLs < 310000))]
    TradeLog = []
    ll = []
    
    for i in dataPathLs:
        try:
            df = pd.read_csv(i)
        except:
            print("empty data")
            print(i)
            ll.append(int(os.path.basename(i).split('.')[0]))
            continue
        df["SecurityID"] = int(os.path.basename(i).split('.')[0])
        TradeLog += [df]
    TradeLog = pd.concat(TradeLog).reset_index(drop=True)
    TradeLog = TradeLog[TradeLog["ChannelNo"] != 4001]
    
    TradeLog["date"] = TradeLog["TransactTime"].iloc[0]//1000000000
    TradeLog = TradeLog.rename(columns={"Qty":"trade_qty", "Price":"trade_price", "ExecType":"trade_type"})
    TradeLog["trade_money"] = TradeLog["trade_price"] * TradeLog["trade_qty"]
    TradeLog["trade_flag"] = 0
    TradeLog["skey"] = TradeLog["SecurityID"] + 2000000
    TradeLog["clockAtArrival"] = TradeLog["TransactTime"].astype(str).apply(lambda x: np.int64(datetime.datetime.strptime(x, '%Y%m%d%H%M%S%f').timestamp()*1e6))
    TradeLog['datetime'] = TradeLog["clockAtArrival"].apply(lambda x: datetime.datetime.fromtimestamp(x/1e6))
    TradeLog["time"] = (TradeLog['TransactTime'] - int(TradeLog['TransactTime'].iloc[0]//1000000000*1000000000)).astype(np.int64)*1000
    TradeLog["trade_type"] = np.where(TradeLog["trade_type"] == 'F', 1, TradeLog["trade_type"])
    for col in ["skey", "date", "ApplSeqNum", "BidApplSeqNum", "OfferApplSeqNum", "trade_qty", "trade_type", "trade_flag"]:
        TradeLog[col] = TradeLog[col].astype('int32')
#     for cols in ["trade_money", "trade_price"]:
#         display(cols)
#         display(TradeLog[cols].astype(str).apply(lambda x: len(str(x.split('.')[1]))).unique())
#         TradeLog[cols] = TradeLog[cols].round(2)
#         display(TradeLog[cols].astype(str).apply(lambda x: len(str(x.split('.')[1]))).unique())
    for cols in ["trade_money"]:
        TradeLog[cols] = TradeLog[cols].round(2)
    
    da_te = str(TradeLog["date"].iloc[0]) 
    da_te = da_te[:4] + '-' + da_te[4:6] + '-' + da_te[6:8]
    db1 = db[db["date"] == da_te]
    sl = (db1["ID"].str[2:].astype(int) + 2000000).unique()
    db1["max_volume"] = db1.groupby("ID")["d_volume"].transform("max")
    db1["max_amount"] = db1.groupby("ID")["d_amount"].transform("max")
    t1 = db1.groupby("ID")["max_volume", "max_amount"].first().reset_index()
    del db1
    t1["skey"] = t1["ID"].str[2:].astype(int) + 2000000
    trade1 = TradeLog[TradeLog["trade_type"] == 1].groupby("skey")["trade_qty"].sum().reset_index()
    trade1.columns=["skey", "cum_volume"]
    trade2 = TradeLog[TradeLog["trade_type"] == 1].groupby("skey")["trade_money"].sum().reset_index()
    trade2.columns=["skey", "cum_amount"]
    t2 = pd.merge(trade1, trade2, on="skey")
    re = pd.merge(t1, t2, on="skey", how="outer")
    try:
        assert(t1.shape[0] == t2.shape[0])
        assert(re[re["cum_volume"] != re["max_volume"]].shape[0] == 0)
        assert(re[re["cum_amount"].round(2) != re["max_amount"]].shape[0] == 0)
    except:
        display(set(t1["skey"]) - set(t2["skey"]))
        display(re[re["cum_volume"] != re["max_volume"]])
        display(re[re["cum_amount"].round(2) != re["max_amount"]])
    del t1
    del t2
    del re
 
    TradeLog = TradeLog[["skey", "date", "time", "clockAtArrival", "datetime", "ApplSeqNum", "trade_type", "trade_flag",
                                                 "trade_price", "trade_qty", "BidApplSeqNum", "OfferApplSeqNum"]]
    print(da_te)
    print("trade finished")

    
    startDate = str(TradeLog["date"].iloc[0])
    endDate = str(TradeLog["date"].iloc[0])
    db1 = DB("mongodb://user_rw:faa96dfc@192.168.10.223")
    # delete all stocks from certain period
    db1.delete('trade', start_date=startDate, end_date=endDate)
    
    db1 = DB("mongodb://user_rw:faa96dfc@192.168.10.223")
    db1.write('trade', TradeLog)
    
    del TradeLog
    print(datetime.datetime.now() - startTm)
    
    
    
    
    
    
    
    
    
    
    
    startTm = datetime.datetime.now()
    
    readPath = data + '\\order\\***'
    dataPathLs = np.array(glob.glob(readPath))
    dateLs = np.array([int(os.path.basename(i).split('.')[0]) for i in dataPathLs])
    dataPathLs = dataPathLs[(dateLs < 4000) | ((dateLs > 300000) & (dateLs < 310000))]
    OrderLog = []
    ll = []
    
    for i in dataPathLs:
        try:
            df = pd.read_csv(i, encoding='GBK')
        except:
            print("empty data")
            print(i)
            ll.append(int(os.path.basename(i).split('.')[0]))
            continue
        df["SecurityID"] = int(os.path.basename(i).split('.')[0])
        OrderLog += [df]
    OrderLog = pd.concat(OrderLog).reset_index(drop=True)
    OrderLog = OrderLog[OrderLog["ChannelNo"] != 4001]
    
    OrderLog = OrderLog.rename(columns={"OrdType": "OrderType"})
    OrderLog["date"] = OrderLog["TransactTime"].iloc[0]//1000000000
    OrderLog["OrderType"] = np.where(OrderLog["OrderType"] == 'U', 3, OrderLog["OrderType"])
    OrderLog["skey"] = OrderLog["SecurityID"] + 2000000
    OrderLog["clockAtArrival"] = OrderLog["TransactTime"].astype(str).apply(lambda x: np.int64(datetime.datetime.strptime(x, '%Y%m%d%H%M%S%f').timestamp()*1e6))
    OrderLog['datetime'] = OrderLog["clockAtArrival"].apply(lambda x: datetime.datetime.fromtimestamp(x/1e6))
    OrderLog["time"] = (OrderLog['TransactTime'] - int(OrderLog['TransactTime'].iloc[0]//1000000000*1000000000)).astype(np.int64)*1000
    
    for col in ["skey", "date", "ApplSeqNum", "OrderQty", "Side", "OrderType"]:
        OrderLog[col] = OrderLog[col].astype('int32')
#     for cols in ["Price"]:
#         print(cols)
#         print(OrderLog[cols].astype(str).apply(lambda x: len(str(x.split('.')[1]))).unique())
    
    assert(OrderLog[((OrderLog["Side"] != 1) & (OrderLog["Side"] != 2)) | (OrderLog["OrderType"].isnull())].shape[0] == 0)
    da_te = str(OrderLog["date"].iloc[0]) 
    da_te = da_te[:4] + '-' + da_te[4:6] + '-' + da_te[6:8]
    try:
        assert(len(set(sl) - set(OrderLog["skey"].unique())) == 0)
    except:
        display(set(sl) - set(OrderLog["skey"].unique()))
    if len(set(OrderLog["skey"].unique()) - set(sl)) != 0:
        print(set(OrderLog["skey"].unique()) - set(sl))
    
    OrderLog = OrderLog.rename(columns={"Side":"order_side", "OrderType":"order_type", "Price":"order_price", "OrderQty":"order_qty"})
    OrderLog = OrderLog[["skey", "date", "time", "clockAtArrival", "datetime", "ApplSeqNum", "order_side", "order_type", "order_price",
                                                 "order_qty"]]
    
    print(OrderLog["date"].iloc[0])
    print("order finished")

    startDate = str(OrderLog["date"].iloc[0])
    endDate = str(OrderLog["date"].iloc[0])
    db1 = DB("mongodb://user_rw:faa96dfc@192.168.10.223")
    # delete all stocks from certain period
    db1.delete('order', start_date=startDate, end_date=endDate)
    
    db1 = DB("mongodb://user_rw:faa96dfc@192.168.10.223")
    db1.write('order', OrderLog)
    
    del OrderLog
    
    print(datetime.datetime.now() - startTm)

C:\Users\win\Anaconda3\lib\site-packages\ipykernel_launcher.py:16: FutureWarning: Using a non-tuple sequence for multidimensional indexing is deprecated; use `arr[tuple(seq)]` instead of `arr[seq]`. In the future this will be interpreted as an array index, `arr[np.array(seq)]`, which will result either in an error or a different result.
  app.launch_new_instance()

0:04:32.981618

C:\Users\win\Anaconda3\lib\site-packages\ipykernel_launcher.py:78: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
C:\Users\win\Anaconda3\lib\site-packages\ipykernel_launcher.py:79: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
455  SZ001914   7050790.0  1.244844e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
455  SZ001914   7050790.0  1.244844e+08  2001914         NaN         NaN

2019-10-08
trade finished
0:05:45.338266

C:\Users\win\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3058: DtypeWarning: Columns (1) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

{2001914}

20191008
order finished
0:06:29.980559

{2001914}

            ID  max_volume    max_amount     skey  cum_volume  cum_amount
454   SZ001914   6158032.0  1.082141e+08  2001914         NaN         NaN
2034  SZ300661   2309568.0  3.882219e+08  2300661   1247166.0  43275839.4

            ID  max_volume    max_amount     skey  cum_volume  cum_amount
454   SZ001914   6158032.0  1.082141e+08  2001914         NaN         NaN
2034  SZ300661   2309568.0  3.882219e+08  2300661   1247166.0  43275839.4

2019-10-09
trade finished
0:05:38.611004

C:\Users\win\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3058: DtypeWarning: Columns (4) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

{2001914}

20191009
order finished
0:06:24.784463

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   5220004.0  93158615.14  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   5220004.0  93158615.14  2001914         NaN         NaN

2019-10-10
trade finished
0:06:01.458871

{2001914}

20191010
order finished
0:06:43.204178

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914  11622636.0  216738949.6  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914  11622636.0  216738949.6  2001914         NaN         NaN

2019-10-11
trade finished
0:06:15.580089

{2001914}

20191011
order finished
0:06:55.105334

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
453  SZ001914   6027730.0  113547718.7  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
453  SZ001914   6027730.0  113547718.7  2001914         NaN         NaN

2019-10-14
trade finished
0:06:33.838237

C:\Users\win\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3058: DtypeWarning: Columns (1,4) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

{2001914}

20191014
order finished
0:07:18.023016

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   5698630.0  109398438.8  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   5698630.0  109398438.8  2001914         NaN         NaN

2019-10-15
trade finished
0:06:29.602570

{2001914}

20191015
order finished
0:07:10.180997

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914   8919873.0  1.745510e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914   8919873.0  1.745510e+08  2001914         NaN         NaN

2019-10-16
trade finished
0:05:59.920987

{2001914}

20191016
order finished
0:06:46.802550

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
453  SZ001914   7610005.0  1.498997e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
453  SZ001914   7610005.0  1.498997e+08  2001914         NaN         NaN

2019-10-17
trade finished
0:05:31.872035

{2001914}

20191017
order finished
0:06:22.569388

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914   9763399.0  1.859281e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914   9763399.0  1.859281e+08  2001914         NaN         NaN

2019-10-18
trade finished
0:06:03.803599

{2001914}

20191018
order finished
0:06:49.428523

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914   6329130.0  1.190761e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914   6329130.0  1.190761e+08  2001914         NaN         NaN

2019-10-21
trade finished
0:05:40.656532

{2001914}

20191021
order finished
0:06:18.039508
2019-10-22
trade finished
0:05:36.400917
20191022
order finished
0:06:24.934062

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914  12698092.0  2.345682e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914  12698092.0  2.345682e+08  2001914         NaN         NaN

2019-10-23
trade finished
0:05:35.330781

{2001914}

20191023
order finished
0:06:14.770256

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
453  SZ001914   5721581.0  1.075381e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
453  SZ001914   5721581.0  1.075381e+08  2001914         NaN         NaN

2019-10-24
trade finished
0:05:39.301169

{2001914}

20191024
order finished
0:06:11.835211

{2001914}

            ID   max_volume    max_amount     skey   cum_volume    cum_amount
30    SZ000038    6397820.0  7.314458e+07  2000038    6396820.0  7.313319e+07
49    SZ000066  184856931.0  2.705208e+09  2000066  184856331.0  2.705199e+09
441   SZ000987   16455522.0  1.485916e+08  2000987   16454622.0  1.485834e+08
453   SZ001914    7061940.0  1.363304e+08  2001914          NaN           NaN
462   SZ002007    8993472.0  3.332840e+08  2002007    8993172.0  3.332728e+08
578   SZ002124  119495133.0  1.877586e+09  2002124  119494733.0  1.877580e+09
885   SZ002434   10163085.0  8.206419e+07  2002434   10162885.0  8.206257e+07
987   SZ002539    7198213.0  3.572492e+07  2002539    7158213.0  3.552678e+07
1037  SZ002589   28211286.0  2.130083e+08  2002589   28182386.0  2.127901e+08
1107  SZ002660    9789100.0  8.427047e+07  2002660    9788100.0  8.426184e+07
1120  SZ002673   11533838.0  1.040799e+08  2002673   11532738.0  1.040699e+08
1638  SZ300253   31570419.0  5.194906e+08  2300253   31569919.0  5.194823e+08

            ID   max_volume    max_amount     skey   cum_volume    cum_amount
30    SZ000038    6397820.0  7.314458e+07  2000038    6396820.0  7.313319e+07
49    SZ000066  184856931.0  2.705208e+09  2000066  184856331.0  2.705199e+09
441   SZ000987   16455522.0  1.485916e+08  2000987   16454622.0  1.485834e+08
453   SZ001914    7061940.0  1.363304e+08  2001914          NaN           NaN
462   SZ002007    8993472.0  3.332840e+08  2002007    8993172.0  3.332728e+08
578   SZ002124  119495133.0  1.877586e+09  2002124  119494733.0  1.877580e+09
885   SZ002434   10163085.0  8.206419e+07  2002434   10162885.0  8.206257e+07
987   SZ002539    7198213.0  3.572492e+07  2002539    7158213.0  3.552678e+07
1037  SZ002589   28211286.0  2.130083e+08  2002589   28182386.0  2.127901e+08
1107  SZ002660    9789100.0  8.427047e+07  2002660    9788100.0  8.426184e+07
1120  SZ002673   11533838.0  1.040799e+08  2002673   11532738.0  1.040699e+08
1638  SZ300253   31570419.0  5.194906e+08  2300253   31569919.0  5.194823e+08

2019-10-25
trade finished
0:05:55.307449

{2001914}

20191025
order finished
0:06:33.514105

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
453  SZ001914   5752663.0  110942382.9  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
453  SZ001914   5752663.0  110942382.9  2001914         NaN         NaN

2019-10-28
trade finished
0:06:39.967837

{2001914}

20191028
order finished
0:07:29.240003

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
453  SZ001914   5375340.0  1.055625e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
453  SZ001914   5375340.0  1.055625e+08  2001914         NaN         NaN

2019-10-29
trade finished
0:07:16.643706

{2001914}

20191029
order finished
0:07:59.376369

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
452  SZ001914   6317655.0  126683394.9  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
452  SZ001914   6317655.0  126683394.9  2001914         NaN         NaN

2019-10-30
trade finished
0:06:37.522380

{2001914}

20191030
order finished
0:07:23.479416

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
453  SZ001914   3746652.0  74436219.84  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
453  SZ001914   3746652.0  74436219.84  2001914         NaN         NaN

2019-10-31
trade finished
0:06:32.509791

{2001914}

20191031
order finished
0:07:08.392782

{2001914}

           ID   max_volume    max_amount     skey   cum_volume    cum_amount
226  SZ000676  137406719.0  1.500229e+09  2000676  137405419.0  1.500215e+09
453  SZ001914    4551103.0  8.905213e+07  2001914          NaN           NaN
730  SZ002279   27237539.0  1.657279e+08  2002279   27236639.0  1.657224e+08
890  SZ002440    5889010.0  6.814563e+07  2002440    5887910.0  6.813292e+07

           ID   max_volume    max_amount     skey   cum_volume    cum_amount
226  SZ000676  137406719.0  1.500229e+09  2000676  137405419.0  1.500215e+09
453  SZ001914    4551103.0  8.905213e+07  2001914          NaN           NaN
730  SZ002279   27237539.0  1.657279e+08  2002279   27236639.0  1.657224e+08
890  SZ002440    5889010.0  6.814563e+07  2002440    5887910.0  6.813292e+07

2019-11-01
trade finished
0:06:15.058485

{2001914}

20191101
order finished
0:07:02.620227

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914   9513880.0  1.913785e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914   9513880.0  1.913785e+08  2001914         NaN         NaN

2019-11-04
trade finished
0:06:15.207088

{2001914}

20191104
order finished
0:07:03.540765

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914   5499021.0  1.123902e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914   5499021.0  1.123902e+08  2001914         NaN         NaN

2019-11-05
trade finished
0:06:22.430757

{2001914}

20191105
order finished
0:07:02.397823

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
453  SZ001914   5293905.0  1.100760e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
453  SZ001914   5293905.0  1.100760e+08  2001914         NaN         NaN

2019-11-06
trade finished
0:06:18.331727

{2001914}

20191106
order finished
0:06:53.946435

{2001914}

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
454  SZ001914   3881900.0  80404157.0  2001914         NaN         NaN

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
454  SZ001914   3881900.0  80404157.0  2001914         NaN         NaN

2019-11-07
trade finished
0:05:53.258813

{2001914}

20191107
order finished
0:06:37.352833

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   9514861.0  201987298.0  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   9514861.0  201987298.0  2001914         NaN         NaN

2019-11-08
trade finished
0:06:12.679850

{2001914}

20191108
order finished
0:06:57.554780

{2001914}

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
454   SZ001914   9629814.0  2.025268e+08  2001914         NaN           NaN
928   SZ002479  16131654.0  1.353130e+08  2002479   3772478.0  3.688940e+07
940   SZ002491   7627800.0  5.027294e+07  2002491  16400248.0  1.522452e+08
1506  SZ300116  28019677.0  4.587794e+07  2300116   6363000.0  1.914207e+07

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
454   SZ001914   9629814.0  2.025268e+08  2001914         NaN           NaN
928   SZ002479  16131654.0  1.353130e+08  2002479   3772478.0  3.688940e+07
940   SZ002491   7627800.0  5.027294e+07  2002491  16400248.0  1.522452e+08
1506  SZ300116  28019677.0  4.587794e+07  2300116   6363000.0  1.914207e+07

2019-11-11
trade finished
0:06:06.376714

{2001914}

20191111
order finished
0:06:37.044658

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914   7397174.0  1.532230e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914   7397174.0  1.532230e+08  2001914         NaN         NaN

2019-11-12
trade finished
0:05:48.056731

{2001914}

20191112
order finished
0:06:33.348548

{2001914}

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
452   SZ001914   4671196.0  9.628663e+07  2001914         NaN           NaN
1114  SZ002670  27062978.0  3.236307e+08  2002670  27061978.0  3.236188e+08

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
452   SZ001914   4671196.0  9.628663e+07  2001914         NaN           NaN
1114  SZ002670  27062978.0  3.236307e+08  2002670  27061978.0  3.236188e+08

2019-11-13
trade finished
0:05:22.620788

{2001914}

20191113
order finished
0:06:03.564239

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914   9836424.0  2.160996e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914   9836424.0  2.160996e+08  2001914         NaN         NaN

2019-11-14
trade finished
0:05:37.193797

{2001914}

20191114
order finished
0:06:21.252911

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914   5866501.0  1.315794e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914   5866501.0  1.315794e+08  2001914         NaN         NaN

2019-11-15
trade finished
0:05:56.055329

{2001914}

20191115
order finished
0:06:39.912983

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   6795300.0  150769346.0  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
455  SZ001914   6795300.0  150769346.0  2001914         NaN         NaN

2019-11-18
trade finished
0:05:34.957779

{2001914}

20191118
order finished
0:06:17.820096

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
453  SZ001914   6238627.0  1.399725e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
453  SZ001914   6238627.0  1.399725e+08  2001914         NaN         NaN

2019-11-19
trade finished
0:06:00.649040

{2001914}

20191119
order finished
0:06:50.310164

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
453  SZ001914   4696378.0  105226121.2  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
453  SZ001914   4696378.0  105226121.2  2001914         NaN         NaN

2019-11-20
trade finished
0:06:15.388601

{2001914}

20191120
order finished
0:07:03.592626

{2001914}

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
453  SZ001914   4206840.0  93528678.5  2001914         NaN         NaN

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
453  SZ001914   4206840.0  93528678.5  2001914         NaN         NaN

2019-11-21
trade finished
0:05:43.841011

{2001914}

20191121
order finished
0:06:33.535048

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
453  SZ001914   9044489.0  1.940017e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
453  SZ001914   9044489.0  1.940017e+08  2001914         NaN         NaN

2019-11-22
trade finished
0:06:44.332160

{2001914}

20191122
order finished
0:07:35.806433

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914  12016469.0  2.481706e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914  12016469.0  2.481706e+08  2001914         NaN         NaN

2019-11-25
trade finished
0:06:00.578229

{2001914}

20191125
order finished
0:06:57.385234

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
455  SZ001914  10502712.0  2.123318e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
455  SZ001914  10502712.0  2.123318e+08  2001914         NaN         NaN

2019-11-26
trade finished
0:05:38.206088

{2001914}

20191126
order finished
0:06:25.737911

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
455  SZ001914  14444208.0  2.860744e+08  2001914         NaN         NaN
663  SZ002209   2014471.0  1.369491e+07  2002209    560300.0    585013.2

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
455  SZ001914  14444208.0  2.860744e+08  2001914         NaN         NaN
663  SZ002209   2014471.0  1.369491e+07  2002209    560300.0    585013.2

2019-11-27
trade finished
0:05:42.440757

{2001914}

20191127
order finished
0:06:18.204068

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914   8601478.0  1.686998e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914   8601478.0  1.686998e+08  2001914         NaN         NaN

2019-11-28
trade finished
0:05:18.441969

{2001914}

20191128
order finished
0:05:54.646101

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914  10173704.0  200630924.8  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914  10173704.0  200630924.8  2001914         NaN         NaN

2019-11-29
trade finished
0:05:17.548374

{2001914}

20191129
order finished
0:05:50.636814

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
453  SZ001914   9924199.0  193398930.6  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
453  SZ001914   9924199.0  193398930.6  2001914         NaN         NaN

2019-12-02
trade finished
0:05:30.083819

{2001914}

20191202
order finished
0:06:24.233936

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914   9180712.0  1.815265e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914   9180712.0  1.815265e+08  2001914         NaN         NaN

2019-12-03
trade finished
0:05:45.408815

{2001914}

20191203
order finished
0:06:31.790716

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914   6936728.0  1.358006e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914   6936728.0  1.358006e+08  2001914         NaN         NaN

2019-12-04
trade finished
0:05:56.838235

{2001914}

20191204
order finished
0:06:39.908995

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   5381600.0  106844254.0  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   5381600.0  106844254.0  2001914         NaN         NaN

2019-12-05
trade finished
0:06:17.782196

{2001914}

20191205
order finished
0:07:15.780017

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
453  SZ001914  11454827.0  2.389187e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
453  SZ001914  11454827.0  2.389187e+08  2001914         NaN         NaN

2019-12-06
trade finished
0:06:21.056437

{2001914}

20191206
order finished
0:07:11.368819

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
453  SZ001914   7631529.0  1.612114e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
453  SZ001914   7631529.0  1.612114e+08  2001914         NaN         NaN

2019-12-09
trade finished
0:06:50.145605

{2001914}

20191209
order finished
0:07:33.824736

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
453  SZ001914   4837631.0  1.023191e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
453  SZ001914   4837631.0  1.023191e+08  2001914         NaN         NaN

2019-12-10
trade finished
0:06:46.137329

{2001914}

20191210
order finished
0:07:36.336017

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
452  SZ001914  12077121.0  2.469201e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
452  SZ001914  12077121.0  2.469201e+08  2001914         NaN         NaN

2019-12-11
trade finished
0:06:48.301538

{2001914}

20191211
order finished
0:07:40.022154

{2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914   5856617.0  1.162321e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
454  SZ001914   5856617.0  1.162321e+08  2001914         NaN         NaN

2019-12-12
trade finished
0:06:53.043850

{2001914}

20191212
order finished
0:07:37.573705

{2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   7096940.0  142983766.5  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
454  SZ001914   7096940.0  142983766.5  2001914         NaN         NaN

2019-12-13
trade finished
0:06:49.028594

{2001914}

20191213
order finished
0:07:33.645215
2019-12-16
trade finished
0:08:03.225072
20191216
order finished
0:09:04.270736
2019-12-17
trade finished
0:09:07.808272
20191217
order finished
0:10:11.593605
2019-12-18
trade finished
0:08:37.687862
20191218
order finished
0:09:38.287720
2019-12-19
trade finished
0:07:56.981776
20191219
order finished
0:08:56.962291

set()

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
686  SZ002235  57852855.0  5.229229e+08  2002235     2068550  12589578.0

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
686  SZ002235  57852855.0  5.229229e+08  2002235     2068550  12589578.0

2019-12-20
trade finished
0:08:01.558531
20191220
order finished
0:09:01.949271
2019-12-23
trade finished
0:07:33.291017
20191223
order finished
0:08:21.737644
2019-12-24
trade finished
0:06:42.177799
20191224
order finished
0:07:25.112871
2019-12-25
trade finished
0:07:14.951986
20191225
order finished
0:08:12.178317
2019-12-26
trade finished
0:07:12.976663
20191226
order finished
0:08:00.016350
2019-12-27
trade finished
0:08:15.828201
20191227
order finished
0:09:12.139804
2019-12-30
trade finished
0:07:58.317268
20191230
order finished
0:08:50.327976
2019-12-31
trade finished
0:06:39.239703
20191231
order finished
0:07:31.490389

In [5]:
db

In [22]:
display(TradeLog[TradeLog["trade_money"].astype(str).apply(lambda x: len(x.split('.')[1])) == 11]["trade_money"].iloc[0])
display(TradeLog[TradeLog["trade_money"].astype(str).apply(lambda x: len(x.split('.')[1])) == 11]["trade_price"].iloc[0])
display(TradeLog[TradeLog["trade_money"].astype(str).apply(lambda x: len(x.split('.')[1])) == 11]["trade_qty"].iloc[0])

118775.99999999999

12.12

9800

In [20]:
TradeLog[TradeLog["trade_money"].astype(str).apply(lambda x: len(x.split('.')[1])) == 11]["trade_qty"].iloc[0] * \
TradeLog[TradeLog["trade_money"].astype(str).apply(lambda x: len(x.split('.')[1])) == 11]["trade_price"].iloc[0]

118775.99999999999

In [36]:
TradeLog[TradeLog["cum_amount"].isnull()]

,skey,date,time,clockAtArrival,datetime,ApplSeqNum,trade_type,trade_flag,trade_price,trade_qty,trade_money,BidApplSeqNum,OfferApplSeqNum,cum_amount
15,2000411,20200106,93011700000,1578274211700000,2020-01-06 09:30:11.700,619736,4,0,0.0,500,0.0,203030,0,NaN
16,2000411,20200106,93012260000,1578274212260000,2020-01-06 09:30:12.260,623469,4,0,0.0,1700,0.0,0,212329,NaN
17,2000411,20200106,93013540000,1578274213540000,2020-01-06 09:30:13.540,632250,4,0,0.0,100,0.0,431387,0,NaN
24,2000411,20200106,93024480000,1578274224480000,2020-01-06 09:30:24.480,685175,4,0,0.0,100,0.0,0,587985,NaN
32,2000411,20200106,93032230000,1578274232230000,2020-01-06 09:30:32.230,721486,4,0,0.0,400,0.0,0,710760,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
36149437,2002420,20200106,145605300000,1578293765300000,2020-01-06 14:56:05.300,19249597,4,0,0.0,1000,0.0,505675,0,NaN
36149438,2002420,20200106,145607930000,1578293767930000,2020-01-06 14:56:07.930,19254244,4,0,0.0,20500,0.0,18901105,0,NaN
36149439,2002420,20200106,145614400000,1578293774400000,2020-01-06 14:56:14.400,19264796,4,0,0.0,3000,0.0,8452009,0,NaN
36149442,2002420,20200106,145644510000,1578293804510000,2020-01-06 14:56:44.510,19315654,4,0,0.0,20000,0.0,19232401,0,NaN
36149443,2002420,20200106,145653150000,1578293813150000,2020-01-06 14:56:53.150,19329639,4,0,0.0,700,0.0,19314987,0,NaN

In [35]:
db[(db["date"] == da_te) & (db["ID"] == "SZ000411")]

,ID,date,d_open,d_high,d_low,d_close,d_yclose,d_cumprodCAA,d_dayReturn,d_5dayReturn,d_ICDayReturn,d_CSIDayReturn,d_volume,d_amount,TORate,allZT,hasZT,isZT,allDT,hasDT,isDT,tmrHalted,haltedDays,marketShares,totalShares
967,SZ000411,2020-01-06,12.2,12.25,12.08,12.16,12.24,0.989683,-0.006536,0.016722,0.010076,0.010286,2016970.0,24560374.22,0.009729,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,207317071.0,248939935.0

In [32]:
TradeLog[TradeLog["cum_amount"].round(2) != TradeLog["cum_amount"]]["cum_amount"].iloc[-1]

15491283.370000001

In [29]:
TradeLog["cum_amount"] = TradeLog[TradeLog["trade_type"] == 1].groupby("skey")["trade_money"].transform("sum")
display(TradeLog["cum_amount"].astype(str).apply(lambda x: len(x.split('.')[1])).unique())

IndexError: list index out of range

In [18]:
TradeLog.head(10)

,skey,date,time,clockAtArrival,datetime,ApplSeqNum,trade_type,trade_flag,trade_price,trade_qty,trade_money,BidApplSeqNum,OfferApplSeqNum
0,2000411,20200106,92500000000,1578273900000000,2020-01-06 09:25:00.000,272180,1,0,12.20,900,10980.0,153803,261100
1,2000411,20200106,92500000000,1578273900000000,2020-01-06 09:25:00.000,272181,1,0,12.20,100,1220.0,226791,261100
2,2000411,20200106,92500000000,1578273900000000,2020-01-06 09:25:00.000,272182,1,0,12.20,1500,18300.0,226791,250449
3,2000411,20200106,92500000000,1578273900000000,2020-01-06 09:25:00.000,272183,1,0,12.20,500,6100.0,16606,250449
4,2000411,20200106,92500000000,1578273900000000,2020-01-06 09:25:00.000,272184,1,0,12.20,500,6100.0,44027,222851
5,2000411,20200106,92500000000,1578273900000000,2020-01-06 09:25:00.000,272185,1,0,12.20,200,2440.0,136108,222851
6,2000411,20200106,92500000000,1578273900000000,2020-01-06 09:25:00.000,272186,1,0,12.20,200,2440.0,136108,250066
7,2000411,20200106,92500000000,1578273900000000,2020-01-06 09:25:00.000,272187,1,0,12.20,1000,12200.0,177935,250066
8,2000411,20200106,93000110000,1578274200110000,2020-01-06 09:30:00.110,331178,1,0,12.14,1000,12140.0,6457,331177
9,2000411,20200106,93001150000,1578274201150000,2020-01-06 09:30:01.150,400901,1,0,12.15,300,3645.0,365630,400900

In [17]:
TradeLog.dtypes

skey                        int32
date                        int32
time                        int64
clockAtArrival              int64
datetime           datetime64[ns]
ApplSeqNum                  int32
trade_type                  int32
trade_flag                  int32
trade_price               float64
trade_qty                   int32
trade_money               float64
BidApplSeqNum               int32
OfferApplSeqNum             int32
dtype: object

In [38]:
re["max_amount"].iloc[0]

1914495474.63

In [21]:
re["max_amount"].iloc[0]

1914495474.63

In [6]:
TradeLog.dtypes

ApplSeqNum                  int64
BidApplSeqNum               int64
SendingTime                 int64
trade_price               float64
ChannelNo                   int64
trade_qty                   int64
OfferApplSeqNum             int64
Amt                         int64
trade_type                 object
TransactTime                int64
SecurityID                  int64
date                        int64
trade_money               float64
trade_flag                  int64
skey                        int64
clockAtArrival              int64
datetime           datetime64[ns]
time                        int64
dtype: object

In [30]:
TradeLog["trade_money"].astype(str).apply(lambda x: len(str(x.split('.')[1]))).unique()

array([1, 2], dtype=int64)

In [32]:
TradeLog["trade_money"] = TradeLog["trade_money"].round(2)
TradeLog["trade_money"].astype(str).apply(lambda x: len(str(x.split('.')[1]))).unique()

array([1, 2], dtype=int64)

In [4]:
TradeLog["trade_price"].astype(str).apply(lambda x: len(str(x.split('.')[1]))).unique()

array([1, 2], dtype=int64)

In [16]:
import pandas as pd
import random
import numpy as np
import glob
import os
import pickle
import datetime

startTm = datetime.datetime.now()

readPath = r'\\192.168.10.30\Kevin_zhenyu\day_stock_20200424\***'
dataPathLs = np.array(glob.glob(readPath))
dataPathLs = dataPathLs[[np.array([os.path.basename(i).split('.')[0][:2] == 'SZ' for i in dataPathLs])]]
db = pd.DataFrame()
for p in dataPathLs:
    dayData = pd.read_csv(p, compression='gzip')
    db = pd.concat([db, dayData])

C:\Users\win\Anaconda3\lib\site-packages\ipykernel_launcher.py:13: FutureWarning: Using a non-tuple sequence for multidimensional indexing is deprecated; use `arr[tuple(seq)]` instead of `arr[seq]`. In the future this will be interpreted as an array index, `arr[np.array(seq)]`, which will result either in an error or a different result.
  del sys.path[0]

In [7]:
da_te = str(TradeLog["date"].iloc[0]) 
da_te = da_te[:4] + '-' + da_te[4:6] + '-' + da_te[6:8]
da_te

'2020-01-03'

In [17]:
db = db[db["date"] == da_te]
db["max_volume"] = db.groupby("ID")["d_volume"].transform("max")
db["max_amount"] = db.groupby("ID")["d_amount"].transform("max")
t1 = db.groupby("ID")["max_volume", "max_amount"].first().reset_index()
t1

            ID   max_volume    max_amount
0     SZ000001  111619481.0  1.914495e+09
1     SZ000002   80553629.0  2.584310e+09
2     SZ000004    1338009.0  2.977932e+07
3     SZ000005    8179044.0  2.566005e+07
4     SZ000006   16565193.0  9.046555e+07
...        ...          ...           ...
2178  SZ300807     214251.0  1.414914e+07
2179  SZ300808    4118807.0  1.024460e+08
2180  SZ300809    3551588.0  9.706851e+07
2181  SZ300810    4605795.0  3.524239e+08
2182  SZ300811      34327.0  1.725275e+06

[2183 rows x 3 columns]

In [18]:
TradeLog["cum_volume"] = TradeLog[TradeLog["trade_type"] == 1].groupby("ID")["trade_qty"].transform("sum")
TradeLog["cum_amount"] = TradeLog[TradeLog["trade_type"] == 1].groupby("ID")["trade_money"].transform("sum")
TradeLog = TradeLog.groupby("ID")["cum_volume", "cum_amount"].first().reset_index()
t2 = TradeLog[["ID", "cum_volume", "cum_amount"]]

In [24]:
t1["ID"] = t1["ID"].str[2:].astype(int) + 2000000
t1

           ID   max_volume    max_amount
0     2000001  111619481.0  1.914495e+09
1     2000002   80553629.0  2.584310e+09
2     2000004    1338009.0  2.977932e+07
3     2000005    8179044.0  2.566005e+07
4     2000006   16565193.0  9.046555e+07
...       ...          ...           ...
2178  2300807     214251.0  1.414914e+07
2179  2300808    4118807.0  1.024460e+08
2180  2300809    3551588.0  9.706851e+07
2181  2300810    4605795.0  3.524239e+08
2182  2300811      34327.0  1.725275e+06

[2183 rows x 3 columns]

In [28]:
re = pd.merge(t1, t2, on="ID", how="outer")
display(re[re["cum_volume"].isnull()])
display(re[re["max_volume"].isnull()])
display(re[re["cum_volume"] != re["max_volume"]])
display(re[re["cum_amount"].round(2) != re["max_amount"]])

Empty DataFrame
Columns: [ID, max_volume, max_amount, cum_volume, cum_amount]
Index: []

Empty DataFrame
Columns: [ID, max_volume, max_amount, cum_volume, cum_amount]
Index: []

Empty DataFrame
Columns: [ID, max_volume, max_amount, cum_volume, cum_amount]
Index: []

Empty DataFrame
Columns: [ID, max_volume, max_amount, cum_volume, cum_amount]
Index: []